<?php

/**
 *      [Discuz!] (C)2001-2099 Comsenz Inc.
 *      This is NOT a freeware, use is subject to license terms
 *
 *      $Id: lang_subnavbanner.php 27449 2012-02-01 05:32:35Z zhangguosheng $
 */

if(!defined('IN_DISCUZ')) {
	exit('Access Denied');
}

$lang = array
(
	'subnavbanner_name' => 'ครอบคลุม ส่วนหัวส่วนหัวคอลัมน์การนำทางรองโฆษณา',
	'subnavbanner_desc' => 'วิธีการแสดงผล: หน้าสองโฆษณาแถบการนำทางระดับจะปรากฏขึ้นเหนือหน้าโดยปกติจะใช้ 960x60 ภาพหรือ Flash รูปร่าง.เมื่อมีหลายคอลัมน์ในหน้าปัจจุบันระบบจะถูกเลือกแบบสุ่ม<br />การวิเคราะห์ค่า: เป็นครั้งแรกที่คุณสามารถเปิดหน้าบนหน้าเนื้อหาของโฆษณาจะแสดงในตำแหน่งที่จับตามองมากที่สุดดังนั้นจึงกลายเป็นหนึ่งในประเภทของการโฆษณาที่มีราคาสูงสุดในหน้าเว็บและเหมาะที่สุดสำหรับ การประชาสัมพันธ์ธุรกิจหรือการส่งเสริมแบรนด์',
	'subnavbanner_index' => 'หน้าแรก',
	'subnavbanner_fids' => 'ส่วนตำแหน่ง',
	'subnavbanner_fids_comment' => 'ตั้งค่าส่วนฟอรั่มสำหรับการโฆษณาซึ่งมีผลบังคับใช้เมื่อโฆษณารวมอยู่ใน "ฟอรั่ม"',
	'subnavbanner_groups' => 'การจำแนกประเภทของกลุ่ม',
	'subnavbanner_groups_comment' => 'การจัดหมวดหมู่การโฆษณากลุ่มถูกตั้งค่าซึ่งมีผลบังคับใช้เมื่อขอบเขตการโฆษณามี "กลุ่ม"',
	'subnavbanner_category' => 'วางช่องพอร์ทัล',
	'subnavbanner_category_comment' => 'การตั้งค่าการจำแนกประเภทช่องของการโฆษณาเมื่อขอบเขตการโฆษณามี "พอร์ทัล" มีประสิทธิภาพ',
);

?>