<?php

/**
 *      [Discuz!] (C)2001-2099 Comsenz Inc.
 *      This is NOT a freeware, use is subject to license terms
 *
 *      $Id: lang_interthread.php 27449 2012-02-01 05:32:35Z zhangguosheng $
 */

if(!defined('IN_DISCUZ')) {
	exit('Access Denied');
}

$lang = array
(
	'interthread_name' => 'เว็บบอร์ด/กรุ๊ป โฆษณาในหน้ากระทู้',
	'interthread_desc' => 'วิธีการแสดงผล: โฆษณาจะปรากฏขึ้นระหว่างโพสต์แรกของกระทู้กับการตอบกลับแรกซึ่งสามารถใช้งานได้ 468x60 หรือภาพและ Flash ขนาดอื่น ๆ<br />เมื่อมีโฆษณาหลายชิ้นระบบจะแสดงแบบสุ่ม การวิเคราะห์มูลค่า: เนื่องจากโฆษณาอยู่ระหว่างช่องว่างตอบกลับขนาดโฆษณาจึงมีขนาดใหญ่และไม่ส่งผลกระทบต่อเนื้อหาของโพสต์จึงไม่ทำให้ผู้เขียนโพสต์และผู้เข้าชมรำคาญ เหมาะสำหรับการประชาสัมพันธ์ธุรกิจหรือการส่งเสริมแบรนด์ในหน้ากระทู้',
	'interthread_fids' => 'เว็บบอร์ดเป้าหมาย',
	'interthread_fids_comment' => 'การตั้งค่าสำหรับแสดงโฆษณาในเว็บบอร์ดซึ่งมีผลบังคับใช้เมื่อ scope ของโฆษณามี "เว็บบอร์ด"',
	'interthread_groups' => 'กรุ๊ปเป้าหมาย',
	'interthread_groups_comment' => 'การตั้งค่าสำหรับแสดงโฆษณาในกรุ๊ปซึ่งมีผลบังคับใช้เมื่อ scope ของโฆษณามี "กรุ๊ป"',
	'interthread_pnumber' => 'แสดงโฆษณาต่อจากโพสต์',
	'interthread_pnumber_comment' => 'เลือกตำแหน่ง #1 #2 #3 ... คุณสามารถกด CTRL ค้างไว้แล้วกดที่ละตำแหน่งเพื่อเลือกหลายตำแหน่ง ค่าเริ่มต้นคือ #1',
);

?>