<?php

/**
 *      [Discuz!] (C)2001-2099 Comsenz Inc.
 *      This is NOT a freeware, use is subject to license terms
 *
 *      $Id: lang_interthread.php 27449 2012-02-01 05:32:35Z zhangguosheng $
 */

if(!defined('IN_DISCUZ')) {
	exit('Access Denied');
}

$lang = array
(
	'interthread_name' => 'ฟอรัม/กลุ่ม โฆษณาสำหรับโพสต์',
	'interthread_desc' => 'วิธีการแสดงผล: โฆษณาโฆษณาในโพสต์จะปรากฏขึ้นระหว่างโพสต์ธีมและการตอบกลับครั้งแรกซึ่งสามารถใช้งานได้ 468x60 หรือภาพขนาดอื่น ๆ และ Flash รูปร่าง.<br />เมื่อมีโฆษณาหลายโพสต์ -คอลัมน์ในหน้าปัจจุบันระบบจะแสดงแบบสุ่มการวิเคราะห์ค่า: เนื่องจากชุดรูปแบบสามารถแยกออกจากการตอบกลับขนาดการโฆษณามีขนาดใหญ่และไม่ส่งผลกระทบต่อเนื้อหาของโพสต์จึงไม่ทำให้ผู้เขียนโพสต์และผู้เข้าชมไม่ชอบซึ่งเหมาะสำหรับการประชาสัมพันธ์ธุรกิจหรือการส่งเสริมแบรนด์ในโพสต์ .',
	'interthread_fids' => 'ส่วนตำแหน่ง',
	'interthread_fids_comment' => 'ตั้งค่าส่วนฟอรัมสำหรับการโฆษณาซึ่งมีผลบังคับใช้เมื่อโฆษณารวมอยู่ใน "ฟอรัม"',
	'interthread_groups' => 'การจำแนกประเภทของกลุ่ม',
	'interthread_groups_comment' => 'การจัดหมวดหมู่การโฆษณากลุ่มถูกตั้งค่าซึ่งมีผลบังคับใช้เมื่อขอบเขตการโฆษณามี "กลุ่ม"',
	'interthread_pnumber' => 'โฆษณาจอแสดงผลโฆษณา',
	'interthread_pnumber_comment' => 'ตัวเลือก #1 #2 #3 ... แสดงโพสต์พื้นคุณสามารถกดค้างไว้ได้ CTRL ตัวเลือกทีละหลายอันให้เป็นค่าเริ่มต้นเท่านั้น 1 อาคาร',
);

?>