<?php

/**
 *      [Discuz!] (C)2001-2099 Comsenz Inc.
 *      This is NOT a freeware, use is subject to license terms
 *
 *      $Id: lang_text.php 27449 2012-02-01 05:32:35Z zhangguosheng $
 */

if(!defined('IN_DISCUZ')) {
	exit('Access Denied');
}

$lang = array
(
	'text_name' => 'พอร์ทัล/ฟอรัม/กรุ๊ป/สเปซ โฆษณากริด',
	'text_desc' => 'วิธีการแสดงผล: โฆษณาข้อความจะแสดงเป็นลิงค์ในหน้าฟอรัมและหน้ากลุ่ม โดยทั่วไปจะอยู่ในรูปแบบของข้อความ สามารถใช้ รูปภาพ หรือ FLASH ได้ เมื่อมีโฆษณาหลายรายการ ระบบจะสุ่มออกมาแสดงแบบเรียงตัว โดยอัตโนมัติแบบไดนามิก จะแสดงที่ละ 3～5 ชิ้น ตามความกว้างของเพจ<br />การวิเคราะห์มูลค่า: เนื่องจากโฆษณาดังกล่าวมักจะแสดงในข้อความตำแหน่งที่อยู่เหนือตำแหน่งเนื้อหาที่ต้องอ่าน โฆษณานี้จึงเหมาะสมสำหรับการส่งเสริมการขายอย่างมีประสิทธิภาพ อีกทั้งยังเหมาะกับการประชาสัมพันธ์และการประกาศของฟอรัมเองด้วย',
	'text_index' => 'หน้าแรก',
	'text_fids' => 'ฟอรั่มเป้าหมาย',
	'text_fids_comment' => 'ตั้งค่าส่วนฟอรัมสำหรับการโฆษณาซึ่งมีผลบังคับใช้เมื่อโฆษณารวมอยู่ใน "ฟอรัม"',
	'text_groups' => 'กรุ๊ปเป้าหมาย',
	'text_groups_comment' => 'การจัดหมวดหมู่การโฆษณากลุ่มถูกตั้งค่าซึ่งมีผลบังคับใช้เมื่อขอบเขตการโฆษณามี "กลุ่ม"',
	'text_category' => 'หมวดเป้าหมาย',
	'text_category_comment' => 'ตั้งค่าหมวดเพื่อแสดงโฆษณา',
);

?>