<?php

/**
 *      [Discuz!] (C)2001-2099 Comsenz Inc.
 *      This is NOT a freeware, use is subject to license terms
 *
 *      $Id: lang_thread.php 27449 2012-02-01 05:32:35Z zhangguosheng $
 */

if(!defined('IN_DISCUZ')) {
	exit('Access Denied');
}

$lang = array
(
	'thread_name' => 'เว็บบอร์ด/กลุ่ม โฆษณาในโพสต์',
	'thread_desc' => 'วิธีการแสดงผล: โฆษณาในโพสต์จะแสดงด้านบนด้านล่างหรือขวาของเนื้อหาโพสต์ด้านบนและด้านล่างของเนื้อหาโพสต์มักจะใช้ในรูปแบบของข้อความด้านขวาของโพสต์มักจะใช้ในรูปแบบของรูปภาพเมื่อมีหลายโพสต์ในหน้าปัจจุบันระบบจะทำการสุ่มแบบสุ่มเพื่อแสดงรายการของแต่ละหน้าแบบสุ่มคุณสามารถ แก้ไขจำนวนโฆษณาที่แสดงในแต่ละโพสต์ในการตั้งค่าอื่น ๆ ในการตั้งค่าภาพรวม <br />การวิเคราะห์ค่า: เนื่องจากโพสต์เป็นส่วนหลักของเว็บบอร์ดโฆษณาในโพสต์ภายในเนื้อหาโพสต์จึงสามารถยอมรับได้ตามธรรมชาติเมื่อผู้ใช้เรียกดูเนื้อหาของโพสต์นอกจากนี้ลักษณะของการเล่นแบบสุ่มจึงเหมาะสำหรับการโปรโมตเนื้อหาเฉพาะที่มีประสิทธิภาพ มันยังสามารถใช้สำหรับใช้สำหรับมันการประชาสัมพันธ์และการประกาศของเว็บบอร์ดเองขอแนะนำให้ตั้งค่าโฆษณาหลายรายการเพื่อให้ตระหนักถึงความแตกต่างของเนื้อหาการโฆษณาซึ่งจะดึงดูดความสนใจของผู้เข้าชมมากขึ้น',
	'thread_fids' => 'ส่วนตำแหน่ง',
	'thread_fids_comment' => 'ตั้งค่าส่วนเว็บบอร์ดสำหรับการโฆษณาซึ่งมีผลบังคับใช้เมื่อโฆษณารวมอยู่ใน "เว็บบอร์ด"',
	'thread_groups' => 'การจำแนกประเภทของกลุ่ม',
	'thread_groups_comment' => 'การจัดหมวดหมู่การโฆษณากลุ่มถูกตั้งค่าซึ่งมีผลบังคับใช้เมื่อขอบเขตการโฆษณามี "กลุ่ม"',
	'thread_position' => 'ตำแหน่ง',
	'thread_position_comment' => 'โฆษณาด้านบนและด้านล่างเนื้อหาโพสต์เหมาะสำหรับการใช้แบบฟอร์มข้อความและโฆษณาทางด้านขวาของโพสต์เหมาะสำหรับการใช้รูปภาพหรือ Flash แบบฟอร์มยังสามารถแสดงโฆษณาข้อความหลายรายการในเวลาเดียวกัน',
	'thread_position_bottom' => 'ด้านล่างโพสต์',
	'thread_position_top' => 'ด้านบนของโพสต์',
	'thread_position_right' => 'ทางด้านขวาของโพสต์',
	'thread_pnumber' => 'โฆษณาจอแสดงผลโฆษณา',
	'thread_pnumber_comment' => 'ตัวเลือก #1 #2 #3 ... แสดงโพสต์พื้นคุณสามารถกด CTRL เพื่อเลือกหลายอัน',
	'thread_pnumber_all' => 'ทั้งหมด',
);

?>