<?php

/**
 *      [Discuz!] (C)2001-2099 Comsenz Inc.
 *      This is NOT a freeware, use is subject to license terms
 *
 *      $Id: lang_headerbanner.php 27449 2012-02-01 05:32:35Z zhangguosheng $
 */

if(!defined('IN_DISCUZ')) {
	exit('Access Denied');
}

$lang = array
(
	'headerbanner_name' => 'ครอบคลุม บุคคลที่ผ่านการโฆษณา',
	'headerbanner_desc' => 'วิธีการแสดงผล: หน้าของหน้าจะแสดงที่ด้านบนของหน้าซึ่งมักจะใช้ 960x60 ภาพหรือ Flash รูปร่าง.เมื่อมีโฆษณาหลายหน้า -หัวในหน้าปัจจุบันระบบจะสุ่มเลือกหนึ่งในนั้น<br />การวิเคราะห์ค่า: เป็นครั้งแรกที่คุณสามารถเปิดหน้าบนหน้าเนื้อหาของโฆษณาจะแสดงในตำแหน่งที่จับตามองมากที่สุดดังนั้นจึงกลายเป็นหนึ่งในประเภทของการโฆษณาที่มีราคาสูงสุดในหน้าเว็บและเหมาะที่สุดสำหรับ การประชาสัมพันธ์ธุรกิจหรือการส่งเสริมแบรนด์',
	'headerbanner_index' => 'หน้าแรก',
	'headerbanner_fids' => 'ส่วนตำแหน่ง',
	'headerbanner_fids_comment' => 'ตั้งค่าส่วนฟอรั่มสำหรับการโฆษณาซึ่งมีผลบังคับใช้เมื่อโฆษณารวมอยู่ใน "ฟอรั่ม"',
	'headerbanner_groups' => 'การจำแนกประเภทของกลุ่ม',
	'headerbanner_groups_comment' => 'การจัดหมวดหมู่การโฆษณากลุ่มถูกตั้งค่าซึ่งมีผลบังคับใช้เมื่อขอบเขตการโฆษณามี "กลุ่ม"',
	'headerbanner_category' => 'วางช่องพอร์ทัล',
	'headerbanner_category_comment' => 'การตั้งค่าการจำแนกประเภทช่องของการโฆษณาเมื่อขอบเขตการโฆษณามี "พอร์ทัล" มีประสิทธิภาพ',
);

?>