<?php

/**
 *      [Discuz!] (C)2001-2099 Comsenz Inc.
 *      This is NOT a freeware, use is subject to license terms
 *
 *      $Id: lang_couplebanner.php 27449 2012-02-01 05:32:35Z zhangguosheng $
 */

if(!defined('IN_DISCUZ')) {
	exit('Access Denied');
}

$lang = array
(
	'couplebanner_name' => 'ครอบคลุม โฆษณาคู่หู',
	'couplebanner_desc' => 'วิธีการแสดงผล: โฆษณา Couplet จะปรากฏขึ้นทั้งสองด้านของหน้าเว็บที่ด้านบนของหน้าในรูปแบบของรูปภาพสี่เหลี่ยม Flash รูปร่าง.โดยทั่วไปโฆษณาของคู่รักจะใช้เฉพาะเมื่อใช้ความกว้างของพิกเซล -to -be เช่นเดียวกับ 90% เมื่อเปอร์เซ็นต์ข้างต้นเห็นด้วยกับความกว้างของแบบฟอร์มหลักมันอาจส่งผลกระทบต่อการท่องปกติของผู้เข้าชมเมื่อความกว้างของเบราว์เซอร์ของผู้เข้าชมน้อยกว่า 800 เมื่อพิกเซลโฆษณาประเภทนี้จะไม่ปรากฏขึ้นโดยอัตโนมัติเมื่อมีหลายคู่ในหน้าปัจจุบันระบบจะถูกเลือกแบบสุ่ม<br />การวิเคราะห์ค่า: การให้คำปรึกษาจะแสดงเฉพาะในความละเอียดสูง(1024x768 หรือสูงกว่า)ทั้งสองด้านของหน้าจอมีเพียงพื้นที่ว่างของหน้าเว็บเท่านั้นดังนั้นจึงไม่ทำให้ผู้เข้าชมน่ารังเกียจและสามารถเน้นเนื้อหาโปรโมชั่นได้เป็นอย่างดีอย่างไรก็ตามเนื่องจากข้อกำหนดพิเศษของความละเอียดและความกว้างของรูปแบบหลักสัดส่วน 100%。',
	'couplebanner_index' => 'หน้าแรก',
	'couplebanner_fids' => 'ส่วนตำแหน่ง',
	'couplebanner_fids_comment' => 'ตั้งค่าส่วนฟอรั่มของการโฆษณา',
	'couplebanner_groups' => 'การจำแนกประเภทของกลุ่ม',
	'couplebanner_groups_comment' => 'การจัดหมวดหมู่การโฆษณากลุ่มถูกตั้งค่าซึ่งมีผลบังคับใช้เมื่อขอบเขตการโฆษณามี "กลุ่ม"',
	'couplebanner_position' => 'ตำแหน่งคู่',
	'couplebanner_position_comment' => 'ตั้งค่าตำแหน่งของคู่โฆษณา',
	'couplebanner_position_left' => 'ซ้าย',
	'couplebanner_position_right' => 'ขวา',
	'couplebanner_coupleadid' => 'ดีกว่า/โฆษณาถัดไป',
	'couplebanner_coupleadid_comment' => 'การตั้งค่าและการจับคู่โฆษณาในปัจจุบัน/โฆษณาถัดไป',
	'couplebanner_category' => 'วางช่องพอร์ทัล',
	'couplebanner_category_comment' => 'ตั้งค่าการจำแนกประเภทช่องโฆษณา，เมื่อการโฆษณามีประสิทธิภาพ',
	'couplebanner_disableclose' => 'ปิดลิงค์ของโฆษณา',
	'couplebanner_disableclose_comment' => 'หากการดำเนินการถูกสร้างขึ้นในการดำเนินการในรหัสโฆษณา，คุณสามารถปิดลิงก์ปิดระบบที่ตั้งไว้ล่วงหน้าได้',
	'couplebanner_show' => 'แสดง',
	'couplebanner_hidden' => 'ซ่อน',
);

?>