<?php

/**
 *      [Discuz!] (C)2001-2099 Comsenz Inc.
 *      This is NOT a freeware, use is subject to license terms
 *
 *      $Id: lang_float.php 27449 2012-02-01 05:32:35Z zhangguosheng $
 */

if(!defined('IN_DISCUZ')) {
	exit('Access Denied');
}

$lang = array
(
	'float_name' => 'ครอบคลุม โฆษณาลอยน้ำ',
	'float_desc' => 'วิธีการแสดงผล: โฆษณาลอยตัวจะปรากฏขึ้นที่มุมซ้ายล่างของหน้าเมื่อหน้าหมุนโฆษณาจะย้ายตัวเองเพื่อรักษาตำแหน่งเดิมมักจะใช้รูปภาพขนาดเล็กหรือ Flash รูปร่าง.เมื่อมีโฆษณาลอยตัวหลายรายการในหน้าปัจจุบันระบบจะแสดงแบบสุ่ม<br />การวิเคราะห์ค่า: การโฆษณาแบบลอยตัวเป็นวิธีที่มีประสิทธิภาพในการส่งเสริมธุรกิจที่แข็งแกร่งการลอยตัวในหน้าทำให้การใส่ใจกับภาพและข้อความคงที่ง่ายขึ้นเนื่องจากผู้สัมภาษณ์คนนี้ที่ไม่สนใจเนื้อหาของโฆษณาโปรดระวังอย่าถ่ายรูปขนาดใหญ่เกินไปหรือ Flash แสดงในรูปแบบของโฆษณาลอยตัวเพื่อหลีกเลี่ยงการอ่านเพจ',
	'float_index' => 'หน้าแรก',
	'float_fids' => 'ส่วนตำแหน่ง',
	'float_fids_comment' => 'ตั้งค่าส่วนฟอรัมสำหรับการโฆษณาซึ่งมีผลบังคับใช้เมื่อโฆษณารวมอยู่ใน "ฟอรัม"',
	'float_groups' => 'การจำแนกประเภทของกลุ่ม',
	'float_groups_comment' => 'การจัดหมวดหมู่การโฆษณากลุ่มถูกตั้งค่าซึ่งมีผลบังคับใช้เมื่อขอบเขตการโฆษณามี "กลุ่ม"',
	'float_position' => 'ตำแหน่งลอยตัว',
	'float_position_comment' => 'ตั้งตำแหน่งการโฆษณาลอยตัว',
	'float_position_left' => 'ซ้าย',
	'float_position_right' => 'ขวา',
	'float_category' => 'วางช่องพอร์ทัล',
	'float_category_comment' => 'การตั้งค่าการจำแนกประเภทช่องของการโฆษณาเมื่อขอบเขตการโฆษณามี "พอร์ทัล" มีประสิทธิภาพ',
	'float_disableclose' => 'ปิดลิงค์ของโฆษณา',
	'float_disableclose_comment' => 'หากคุณมีการดำเนินการในตัวในรหัสโฆษณาคุณสามารถปิดลิงค์ปิดที่ตั้งไว้ล่วงหน้าของระบบ',
	'float_show' => 'แสดง',
	'float_hidden' => 'ซ่อน',
);

?>