<?php

/**
 *      [Discuz!] (C)2001-2099 Comsenz Inc.
 *      This is NOT a freeware, use is subject to license terms
 *
 *      $Id: lang_float.php 27449 2012-02-01 05:32:35Z zhangguosheng $
 */

if(!defined('IN_DISCUZ')) {
	exit('Access Denied');
}

$lang = array
(
	'float_name' => 'ทั่วไป โฆษณาลอยตัว',
	'float_desc' => 'วิธีการแสดงผล: โฆษณาลอยตัวจะปรากฏขึ้นที่มุมซ้ายล่างของหน้าเมื่อเลื่อนเพจโฆษณาจะย้ายตัวเองตามเพื่อรักษาตำแหน่งเดิมมักจะใช้รูปภาพขนาดเล็กหรือ Flash เมื่อมีโฆษณาลอยตัวหลายรายการระบบจะแสดงแบบสุ่ม<br />การวิเคราะห์มูลค่า: โฆษณาแบบลอยตัวเป็นวิธีที่มีประสิทธิภาพในการส่งเสริมธุรกิจ การลอยตัวคงที่ในหน้าจะทำให้ภาพและข้อความที่เห็นกลายเป็นจุดสนใจ โปรดระวังอย่าใช้รูป หรือ Flash มีขนาดใหญ่เกินไป อาจทำให้มันไปบดบังเนื้อหาของเพจได้',
	'float_index' => 'หน้าแรก',
	'float_fids' => 'เว็บบอร์ดเป้าหมาย',
	'float_fids_comment' => 'การตั้งค่าสำหรับแสดงโฆษณาในเว็บบอร์ดซึ่งมีผลบังคับใช้เมื่อ scope ของโฆษณามี "เว็บบอร์ด"',
	'float_groups' => 'คลับเป้าหมาย',
	'float_groups_comment' => 'การตั้งค่าสำหรับแสดงโฆษณาในคลับซึ่งมีผลบังคับใช้เมื่อ scope ของโฆษณามี "คลับ"',
	'float_position' => 'ตำแหน่งลอยตัว',
	'float_position_comment' => 'ตั้งตำแหน่งการโฆษณาลอยตัว',
	'float_position_left' => 'ซ้าย',
	'float_position_right' => 'ขวา',
	'float_category' => 'หมวดเป้าหมาย',
	'float_category_comment' => 'การตั้งค่าสำหรับแสดงโฆษณาในหมวดซึ่งมีผลบังคับใช้เมื่อ scope ของโฆษณามี "หมวด"',
	'float_disableclose' => 'ปิดลิงก์ของโฆษณา',
	'float_disableclose_comment' => 'หากโค้ดโฆษณาคุณมีลิงก์ในตัวอยู่แล้ว คุณสามารถปิดลิงก์ที่ระบบตั้งไว้ล่วงหน้าได้',
	'float_show' => 'แสดง',
	'float_hidden' => 'ซ่อน',
);

?>