<?php

/**
 *      [Discuz!] (C)2001-2099 Comsenz Inc.
 *      This is NOT a freeware, use is subject to license terms
 *
 *      $Id: lang_text.php 27449 2012-02-01 05:32:35Z zhangguosheng $
 */

if(!defined('IN_DISCUZ')) {
	exit('Access Denied');
}

$lang = array
(
	'text_name' => 'พอร์ทัล/ฟอรัม/กลุ่ม/ช่องว่าง โฆษณากริด',
	'text_desc' => 'วิธีการแสดงผล: โฆษณาข้อความในหน้าจะแสดงในรูปแบบของรูปแบบในรูปแบบของฟอรัมและหน้ากลุ่มโดยทั่วไปรูปแบบของข้อความยังสามารถใช้ FLASH เมื่อมีโฆษณาข้อความหลายรายการในหน้าปัจจุบันระบบจะแสดงในรูปแบบของการแสดงผลชุดในรูปแบบของแบบฟอร์ม 3～5 การปล่อยแบบไดนามิกภายในช่วงเพื่อให้ได้เอฟเฟกต์การจัดการโฆษณาที่ดีที่สุดโดยอัตโนมัติ<br />การวิเคราะห์ค่า: เนื่องจากโฆษณาดังกล่าวมักจะแสดงในข้อความตำแหน่งที่สูงขึ้นที่พวกเขาอยู่ในตำแหน่งได้สร้างโฆษณาดังกล่าวหนึ่งในเนื้อหาที่ต้องอ่านของผู้เข้าชมหน้าเดียวกันสามารถนำเสนอลักษณะของโฆษณาข้อความได้ถึงโหลซึ่งเป็นตัวกำหนดว่าเป็นวิธีการส่งเสริมการขายพลเรือน แต่มีประสิทธิภาพในเวลาเดียวกันก็สามารถใช้สำหรับการประชาสัมพันธ์และการประกาศของฟอรัมเอง',
	'text_index' => 'หน้าแรก',
	'text_fids' => 'ส่วนตำแหน่ง',
	'text_fids_comment' => 'ตั้งค่าส่วนฟอรัมสำหรับการโฆษณาซึ่งมีผลบังคับใช้เมื่อโฆษณารวมอยู่ใน "ฟอรัม"',
	'text_groups' => 'การจำแนกประเภทของกลุ่ม',
	'text_groups_comment' => 'การจัดหมวดหมู่การโฆษณากลุ่มถูกตั้งค่าซึ่งมีผลบังคับใช้เมื่อขอบเขตการโฆษณามี "กลุ่ม"',
	'text_category' => 'การจำแนกประเภทของช่องเปิดตัว',
	'text_category_comment' => 'ตั้งค่าการจำแนกประเภทช่องโฆษณา',
);

?>