<?php

$language = array(

	'config_dbhost' => 'เซิร์ฟเวอร์ฐานข้อมูล',
	'config_dbuser' => 'ชื่อผู้ใช้ฐานข้อมูล',
	'config_dbpw' => 'รหัสผ่านฐานข้อมูล',
	'config_dbname' => 'ฐานข้อมูล',
	'config_tablepre' => 'คำนำหน้าตารางข้อมูล',
	'config_dbcharset' => 'ชุดอักขระตารางข้อมูล (ไม่จำเป็น)',
	'config_pconnect' => 'การเชื่อมต่อแบบยั่งยืน',

	'config_type_source' => 'การตั้งค่าเซิร์ฟเวอร์แหล่งข้อมูล (ฐานข้อมูลดั้งเดิม)',
	'config_type_target' => 'การตั้งค่าเซิร์ฟเวอร์เป้าหมาย (ทำตั้งค่าฐานข้อมูล Discuz! X ให้ถูกต้อง)',
	'config_type_ucenter' => 'การตั้งค่าเซิร์ฟเวอร์ UCenter (ทำการติดค่าฐานข้อมูล UCenter ให้ถูกต้อง)',

	'config_type_target_comment' => 'ข้อสังเกต：ข้อมูลของฐานข้อมูลฝั่งเป้าหมายจะถูกแทนที่หรืออัปเดตหากมีเนื้อหาสำคัญกรุณาสำรองข้อมูลก่อน',
	'config_write_error' => 'เครื่องแปลงไม่สามารถเขียนไดเรกทอรี data/ ได้ โปรดตรวจสอบให้แน่ใจว่าได้รับอนุญาตการเขียนของไดเรกทอรีนี้ และได้ตั้งแอททริบิวเป็น 777 ',

	'config_save' => 'บันทึกการตั้งค่าเซิร์ฟเวอร์',
	'config_usergroup' => 'กำหนดค่ากลุ่มผู้ใช้',
	'config_from_usergroup' => 'กลุ่มผู้ใช้จาก',
	'config_target_usergroup' => 'กลุ่มผู้ใช้เป้าหมาย',
	'config_extcredits' => 'กำหนดค่าเครดิต',
	'config_credit' => 'เครดิต',
	'config_from_credit' => 'เครดิตจาก',
	'config_target_credit' => 'เครดิตเป้าหมาย',
	'config_experience' => 'ประสบการณ์',
	'config_convert_forum' => 'กำหนดค่าการแปลงข้อมูล',
	'config_from_data' => 'ข้อมูลจาก',
	'config_target_forum' => 'ฟอรัมเป้าหมาย',
	'config_poll' => 'โพลล์',
	'config_event' => 'กิจกรรม',
	'config_auto_create' => 'สร้างโดยอัตโนมัติ',
	'config_convert' => 'ค่าการแปลงที่กำหนดไว้',

	'submit' => 'กด เริ่ม',

	'message_return' => 'กลับไปที่ขั้นตอนก่อนหน้า',
	'message_stop' => 'หยุด',
	'message_not_enabled_extcredit' => 'ควรเปิดอย่างน้อยหนึ่งจุดในระบบใหม่ มิฉะนั้นขั้นตอนต่อไปจะไม่สามารถทำได้',

	'ok' => '&nbsp;ตก&nbsp;&nbsp;ลง&nbsp;',
	'cancel' => '&nbsp;ยก&nbsp;เลิก&nbsp;',
	'return' => 'ย้อนกลับ',
	'tips' => 'เคล็ดลับ',
	'tips_pconnect' => 'ข้อสังเกต：หากฐานข้อมูลต้นทางและฐานข้อมูลเป้าหมายอยู่ในเซิร์ฟเวอร์เดียวกัน，รายการนี้จะต้องตั้งค่าเป็น 0，มิฉะนั้นจะถูกตั้งค่าเป็น 1',

	'mysql_config_error' => 'การกำหนดค่าไม่สามารถว่างเปล่า',
	'mysql_connect_error' => 'การเชื่อมต่อล้มเหลว',

	'config_success' => 'การกำหนดค่าเซิร์ฟเวอร์ประสบความสำเร็จ ไปยังขั้นตอนต่อไป',

	'setting_tips' => '<li>ปรับเปลี่ยนการตั้งค่าโปรแกรมการแปลงอาจทำให้ประสิทธิภาพการแปลงของคุณลดลงหรือไม่สามารถทำการแปลงได้ตามปกติ，ดังนั้นโปรดระวังการแก้ไข',

	'mysql_connect_error_1' => 'ข้อผิดพลาดในการตรวจสอบตารางข้อมูล โปรดตรวจสอบว่าบัญชีและรหัสผ่านฐานข้อมูลถูกต้องหรือไม่',
	'mysql_connect_error_2' => 'ข้อผิดพลาดในการตรวจสอบตารางข้อมูล คุณอาจกรอก “คำนำหน้าตารางข้อมูล” ไม่ถูกต้อง หรือคุณยังไม่ได้ติดตั้งโปรแกรมของเวอร์ชันนี้',



);