<?php

define('UC_VERNAME', 'ภาษาไทย');

$lang = array(

	'SC_UTF8' => '简体中文 UTF8 版',
	'TC_UTF8' => '繁体中文 UTF8 版',
	'TH_UTF8' => 'ภาษาไทย UTF8',

	'title_install' => SOFT_NAME.' คู่มือการติดตั้ง',
	'agreement_yes' => 'ฉันเห็นด้วย',
	'agreement_no' => 'ฉันไม่เห็นด้วย',
	'notset' => 'ไม่ จำกัด',

	'message_title' => 'ข้อมูลแจ้ง',
	'error_message' => 'ข้อความผิดพลาด',
	'message_return' => 'กลับ',
	'return' => 'กลับ',
	'install_wizard' => 'คู่มือการติดตั้ง',
	'config_nonexistence' => 'ไม่มีไฟล์กำหนดค่า',
	'nodir' => 'ไดเรกทอรีไม่มีอยู่จริง',
	'short_open_tag_invalid' => 'ขอโทษโปรด php.ini ปานกลาง short_open_tag กำหนดให้เป็น On มิฉะนั้นคุณไม่สามารถติดตั้งต่อไปได้',
	'redirect' => 'เบราว์เซอร์จะข้ามหน้าโดยอัตโนมัติโดยไม่มีการแทรกแซงด้วยตนเอง<br>เว้นแต่ว่าเมื่อเบราว์เซอร์ของคุณไม่กระโดดโดยอัตโนมัติโปรดคลิกที่นี่',

	'database_errno_2003' => 'ไม่สามารถเชื่อมต่อกับฐานข้อมูล โปรดตรวจสอบว่าฐานข้อมูลเริ่มต้นหรือไม่ ไม่ว่าที่อยู่เซิร์ฟเวอร์ฐานข้อมูลจะถูกต้อง',
	'database_errno_1044' => 'ไม่สามารถสร้างฐานข้อมูลใหม่ โปรดตรวจสอบว่าชื่อฐานข้อมูลถูกต้องหรือไม่',
	'database_errno_1045' => 'ไม่สามารถเชื่อมต่อกับฐานข้อมูล โปรดตรวจสอบว่าชื่อผู้ใช้ฐานข้อมูลหรือรหัสผ่านถูกต้อง',
	'database_errno_1064' => 'SQL ข้อผิดพลาดทางไวยากรณ์',

	'dbpriv_createtable' => 'ไม่ CREATE TABLE สิทธิ์ไม่สามารถติดตั้งต่อไปได้',
	'dbpriv_insert' => 'ไม่ INSERT สิทธิ์ไม่สามารถติดตั้งต่อไปได้',
	'dbpriv_select' => 'ไม่ SELECT สิทธิ์ไม่สามารถติดตั้งต่อไปได้',
	'dbpriv_update' => 'ไม่ UPDATE สิทธิ์ไม่สามารถติดตั้งต่อไปได้',
	'dbpriv_delete' => 'ไม่ DELETE สิทธิ์ไม่สามารถติดตั้งต่อไปได้',
	'dbpriv_droptable' => 'ไม่ DROP TABLE สิทธิ์ไม่สามารถติดตั้งได้',

	'db_not_null' => 'ก่อตั้งขึ้นในฐานข้อมูล UCenter, การติดตั้งดำเนินการต่อจะล้างข้อมูลต้นฉบับ',
	'db_drop_table_confirm' => 'การติดตั้งต่อไปจะทำให้ข้อมูลต้นฉบับทั้งหมดว่างเปล่า แน่ใจหรือว่าต้องการดำเนินการต่อ?',

	'writeable' => 'เขียน',
	'unwriteable' => 'ไม่เขียน',
	'old_step' => 'ก่อนหน้า',
	'new_step' => 'ขั้นตอนต่อไป',

	'database_errno_2003' => 'ไม่สามารถเชื่อมต่อกับฐานข้อมูล โปรดตรวจสอบว่าฐานข้อมูลเริ่มต้นหรือไม่ ไม่ว่าที่อยู่เซิร์ฟเวอร์ฐานข้อมูลจะถูกต้อง',
	'database_errno_1044' => 'ไม่สามารถสร้างฐานข้อมูลใหม่ โปรดตรวจสอบว่าชื่อฐานข้อมูลถูกต้องหรือไม่',
	'database_errno_1045' => 'ไม่สามารถเชื่อมต่อกับฐานข้อมูล โปรดตรวจสอบว่าชื่อผู้ใช้ฐานข้อมูลหรือรหัสผ่านถูกต้อง',

	'step_env_check_title' => 'เริ่มการติดตั้ง',
	'step_env_check_desc' => 'การตรวจสอบสิทธิ์การใช้งานไดเรกทอรีสภาพแวดล้อมและไฟล์',
	'step_db_init_title' => 'ติดตั้งฐานข้อมูล',
	'step_db_init_desc' => 'กำลังดำเนินการติดตั้งฐานข้อมูล',

	'step1_file' => 'ไฟล์ไดเรกทอรี',
	'step1_need_status' => 'สถานะที่จำเป็น',
	'step1_status' => 'สถานะปัจจุบัน',
	'not_continue' => 'โปรดแก้ไขส่วนด้านบน Red Fork และลองอีกครั้ง',

	'tips_dbinfo' => 'กรอกข้อมูลฐานข้อมูล',
	'tips_dbinfo_comment' => '',
	'tips_admininfo' => 'กรอกข้อมูลผู้ดูแลระบบ',
	'tips_admininfo_comment' => 'กรุณาเก็บไว้ในใจ UCenter รหัสผ่านผู้ก่อตั้ง เข้าสู่ระบบด้วยรหัสผ่านนี้ UCenter。',
	'step_ext_info_title' => 'การติดตั้งที่ประสบความสำเร็จ ',
	'step_ext_info_desc' => 'คลิกเพื่อเข้าสู่การเข้าสู่ระบบ',

	'ext_info_succ' => 'การติดตั้งที่ประสบความสำเร็จ ',
	'install_locked' => 'ล็อคการติดตั้ง ติดตั้งแล้ว หากคุณแน่ใจว่าจะติดตั้งใหม่ โปรดลบลงบนเซิร์ฟเวอร์<br /> '.str_replace(ROOT_PATH, '', $lockfile),
	'error_quit_msg' => 'คุณต้องแก้ปัญหาข้างต้น การติดตั้งเท่านั้นสามารถดำเนินการต่อได้',

	'step_app_reg_title' => 'ตั้งค่าสภาพแวดล้อมการดำเนินงาน',
	'step_app_reg_desc' => 'ตรวจจับสภาพแวดล้อมและการตั้งค่าเซิร์ฟเวอร์ UCenter',
	'tips_ucenter' => 'กรุณากรอกข้อมูล UCenter ข้อมูลที่เกี่ยวข้อง',
	'tips_ucenter_comment' => 'UCenter ใช่ Comsenz โปรแกรมบริการหลักของผลิตภัณฑ์ของ บริษัท Discuz! Board การติดตั้งและการทำงานขึ้นอยู่กับโปรแกรมนี้หากคุณติดตั้ง UCenter กรุณากรอกข้อมูลต่อไปนี้มิฉะนั้น เชิญชวน <a href="http://www.discuz.com/" target="blank">Comsenz ศูนย์ผลิตภัณฑ์</a> ดาวน์โหลดและติดตั้ง จากนั้นดำเนินการต่อ',

	'advice_mysqli_connect' => 'โปรดตรวจสอบ mysqli ไม่ว่าจะมีการโหลดโมดูลอย่างถูกต้อง',
	'advice_xml_parser_create' => 'ฟังก์ชั่นนี้ต้องการ PHP สนับสนุน XML แก่นแท้กรุณาติดต่อผู้ให้บริการ กำหนดคุณสมบัตินี้',
	'advice_json_encode' => 'ฟังก์ชั่นนี้ต้องการ PHP สนับสนุน JSON แก่นแท้กรุณาติดต่อผู้ให้บริการ กำหนดคุณสมบัตินี้',
	'advice_fsockopen' => 'ฟังก์ชั่นนี้ต้องการ php.ini กลาง allow_url_fopen ตัวเลือกเปิดใช้งานกรุณาติดต่อผู้ให้บริการ กำหนดคุณสมบัตินี้',
	'advice_pfsockopen' => 'ฟังก์ชั่นนี้ต้องการ php.ini กลาง allow_url_fopen ตัวเลือกเปิดใช้งานกรุณาติดต่อผู้ให้บริการ กำหนดคุณสมบัตินี้',
	'advice_stream_socket_client' => 'ฟังก์ชั่นนี้ต้องการ php.ini กลาง stream_socket_client ฟังก์ชั่นเปิดใช้งานกรุณาติดต่อผู้ให้บริการ กำหนดคุณสมบัตินี้',
	'advice_curl_init' => 'ฟังก์ชั่นนี้ต้องการ php.ini กลาง curl_init ฟังก์ชั่นเปิดใช้งานกรุณาติดต่อผู้ให้บริการ กำหนดคุณสมบัตินี้',

	'undefine_func' => 'ไม่มีฟังก์ชั่น',
	'mysqli_unsupport' => 'โปรดตรวจสอบ mysqli ไม่ว่าจะมีการโหลดโมดูลอย่างถูกต้อง',

	'ucurl' => 'UCenter ของ URL',
	'ucpw' => 'UCenter รหัสผ่านผู้ก่อตั้ง',

	'tips_siteinfo' => 'กรุณากรอกข้อมูลเว็บไซต์',
	'sitename' => 'ชื่อเว็บไซต์',
	'siteurl' => 'เว็บไซต์ URL',

	'forceinstall' => 'การติดตั้งบังคับ',
	'dbinfo_forceinstall_invalid' => 'ฐานข้อมูลปัจจุบันมีตารางข้อมูลที่มีคำนำหน้าตารางเดียวกัน คุณสามารถแก้ไข "คำนำหน้าชื่อตาราง" เพื่อหลีกเลี่ยงการลบข้อมูลเก่า หรือเลือกสำหรับการติดตั้งภาคบังคับการติดตั้งที่ถูกบังคับจะลบข้อมูลเก่า ไม่สามารถกู้คืนได้',

	'click_to_back' => 'คลิกเพื่อกลับไปที่ขั้นตอนก่อนหน้า',
	'adminemail' => 'กล่องจดหมาย Email',
	'adminemail_comment' => 'ใช้เพื่อส่งรายงานข้อผิดพลาดของโปรแกรม',
	'dbhost_comment' => 'ที่อยู่เซิร์ฟเวอร์ฐานข้อมูล, โดยทั่วไป localhost',
	'tablepre_comment' => 'เมื่อเรียกใช้หลายฟอรัมในฐานข้อมูลเดียวกัน กรุณาแก้ไขคำนำหน้า',
	'forceinstall_check_label' => 'ฉันต้องการลบข้อมูล การติดตั้งบังคับ !!!',

	'uc_url_empty' => 'คุณไม่ได้เติมเต็ม UCenter ของ URL โปรดกลับไปเติมเต็ม',
	'uc_url_invalid' => 'URL รูปแบบผิด',
	'uc_url_unreachable' => 'UCenter ของ URL ที่อยู่อาจกรอกข้อผิดพลาด โปรดตรวจสอบ',
	'uc_ip_invalid' => 'ไม่สามารถแยกวิเคราะห์ชื่อโดเมนได้ กรุณากรอกข้อมูลในเว็บไซต์ IP</font>',
	'uc_admin_invalid' => 'UCข้อผิดพลาดรหัสผ่านของผู้ก่อตั้ง กรุณากรอกข้อมูล',
	'uc_data_invalid' => 'การสื่อสารที่ล้มเหลว โปรดตรวจสอบ UCของURL ไม่ว่าที่อยู่จะถูกต้อง ',
	'ucenter_ucurl_invalid' => 'UCของURLมันว่างเปล่า หรือข้อผิดพลาดในรูปแบบ โปรดตรวจสอบ',
	'ucenter_ucpw_invalid' => 'UCรหัสผ่านผู้ก่อตั้งว่างเปล่า หรือข้อผิดพลาดในรูปแบบ โปรดตรวจสอบ',
	'siteinfo_siteurl_invalid' => 'เว็บไซต์URLมันว่างเปล่า หรือข้อผิดพลาดในรูปแบบ โปรดตรวจสอบ',
	'siteinfo_sitename_invalid' => 'ชื่อไซต์ว่างเปล่า หรือข้อผิดพลาดในรูปแบบ โปรดตรวจสอบ',
	'dbinfo_dbhost_invalid' => 'เซิร์ฟเวอร์ฐานข้อมูลว่างเปล่า หรือข้อผิดพลาดในรูปแบบ โปรดตรวจสอบ',
	'dbinfo_dbname_invalid' => 'ชื่อฐานข้อมูลว่างเปล่า หรือข้อผิดพลาดในรูปแบบ โปรดตรวจสอบ',
	'dbinfo_dbuser_invalid' => 'ชื่อผู้ใช้ฐานข้อมูลว่างเปล่า หรือข้อผิดพลาดในรูปแบบ โปรดตรวจสอบ',
	'dbinfo_dbpw_invalid' => 'รหัสผ่านฐานข้อมูลว่างเปล่า หรือข้อผิดพลาดในรูปแบบ โปรดตรวจสอบ',
	'dbinfo_adminemail_invalid' => 'กล่องจดหมายของระบบว่างเปล่า หรือข้อผิดพลาดในรูปแบบ โปรดตรวจสอบ',
	'dbinfo_tablepre_invalid' => 'คำนำหน้าชื่อตารางไม่มีอักขระ".",ไม่สามารถเริ่มต้นด้วยตัวเลข',
	'admininfo_username_invalid' => 'ชื่อผู้ใช้ของผู้ดูแลระบบว่างเปล่า หรือข้อผิดพลาดในรูปแบบ โปรดตรวจสอบ',
	'admininfo_email_invalid' => 'ผู้ดูแลระบบEmailมันว่างเปล่า หรือข้อผิดพลาดในรูปแบบ โปรดตรวจสอบ',
	'admininfo_ucfounderpw_invalid' => 'รหัสผ่านผู้ดูแลระบบว่างเปล่า กรุณากรอกข้อมูล',
	'admininfo_ucfounderpw2_invalid' => 'รหัสผ่านสองรหัสไม่สอดคล้องกัน โปรดตรวจสอบ',

	'username' => 'บัญชีผู้ดูแลระบบ',
	'email' => 'ผู้ดูแลระบบ Email',
	'password' => 'รหัสผ่านผู้ดูแลระบบ',
	'password_comment' => 'รหัสผ่านของผู้ดูแลระบบไม่สามารถว่างได้',
	'password2' => 'ทำซ้ำรหัสผ่าน',

	'admininfo_invalid' => 'ข้อมูลที่ไม่เหมาะสมของผู้ดูแลระบบ โปรดตรวจสอบบัญชีผู้ดูแลระบบ รหัสผ่าน ส่งจดหมาย',
	'dbname_invalid' => 'ชื่อฐานข้อมูลว่างเปล่า กรุณากรอกชื่อฐานข้อมูล',
	'admin_username_invalid' => 'ชื่อผู้ใช้ที่ผิดกฎหมาย ความยาวชื่อผู้ใช้ไม่ควรเกินกว่า 15 ตัวละครภาษาอังกฤษ และไม่สามารถรวมอักขระพิเศษ โดยทั่วไปภาษาจีน จดหมายหรือหมายเลข',
	'admin_password_invalid' => 'รหัสผ่านไม่สอดคล้องกับข้างต้น กรุณากรอกอีกครั้ง',
	'admin_email_invalid' => 'Email ที่อยู่ผิด ที่อยู่อีเมลนี้ถูกใช้หรือรูปแบบไม่ถูกต้อง กรุณาแทนที่ด้วยที่อยู่อื่น ๆ',
	'admin_invalid' => 'ข้อมูลผู้ดูแลข้อมูลของคุณไม่ได้กรอกข้อมูลที่สมบูรณ์ กรุณากรอกข้อมูลในแต่ละโครงการอย่างระมัดระวัง',
	'admin_exist_password_error' => 'ผู้ใช้มีอยู่แล้ว หากคุณต้องการตั้งค่าผู้ใช้นี้เป็นผู้ดูแลระบบของฟอรัม โปรดป้อนรหัสผ่านของผู้ใช้อย่างถูกต้อง หรือโปรดแทนที่ชื่อของผู้ดูแลฟอรัม',

	'tagtemplates_subject' => 'หัวข้อ',
	'tagtemplates_uid' => 'ผู้ใช้ ID',
	'tagtemplates_username' => 'โปสเตอร์',
	'tagtemplates_dateline' => 'วันที่',
	'tagtemplates_url' => 'ที่อยู่ธีม',

	'uc_version_incorrect' => 'ของคุณ UCenter เวอร์ชันด้านบริการต่ำเกินไป กรุณาอัพเกรด UCenter เวอร์ชันล่าสุด อัพเกรด ลิ้งค์ดาวน์โหลด：http://www.comsenz.com/',
	'config_unwriteable' => 'ตัวช่วยสร้างการติดตั้งไม่สามารถเขียนลงในไฟล์การกำหนดค่าได้, กรุณาตั้งค่า config.inc.php แอตทริบิวต์โปรแกรมคือการเขียน -สถานะที่สามารถใช้งานได้(777)',

	'install_in_processed' => 'กำลังติดตั้ง...',
	'install_succeed' => 'ติดตั้งศูนย์ผู้ใช้แล้ว คลิกเพื่อเข้าสู่ขั้นตอนต่อไป',
	'copyright' => 'ลิขสิทธิ์ &copy; 2001-'.date('Y').' เทนเซ็นต์คลาวด์',
	'license' => '<div class="license"><h1>ใบอนุญาตและข้อตกลงการใช้งาน</h1>

<p>สงวนลิขสิทธิ์ (c) 2001-'.date('Y'). ' บริษัท เทนเซนคลาวด์คอมพิวติ้ง (ปักกิ่ง) จำกัด (เดิมชื่อ บริษัท ปักกิ่งคังเซิงซินฉวงวิทยาศาสตร์และเทคโนโลยี จำกัด) ผู้เป็นเจ้าของ</p>

<p>ขอบคุณที่เลือก UCenterผลิตภัณฑ์.ฉันหวังว่าความพยายามของเราจะช่วยให้คุณมีโซลูชันไซต์ที่มีประสิทธิภาพและรวดเร็วและทรงพลัง</p>

<p>ปักกิ่ง Kangsheng Xinchuang Technology Co. , Ltd. UCenter ผู้พัฒนาผลิตภัณฑ์ เป็นอิสระตามกฎหมาย UCenter ลิขสิทธิ์ผลิตภัณฑ์Beijing Kangsheng Xinchuang Technology Co. , Ltd. เว็บไซต์คือ http://www.comsenz.com UCenter เว็บไซต์อย่างเป็นทางการเว็บไซต์คือ http://www.discuz.com UCenter เว็บไซต์พื้นที่สนทนาอย่างเป็นทางการคือ http://www.discuz.net。</p>

<p>UCenter ลิขสิทธิ์ได้รับการจดทะเบียนที่สำนักงานลิขสิทธิ์แห่งชาติของสาธารณรัฐประชาชนจีน ลิขสิทธิ์ได้รับการคุ้มครองตามกฎหมายและอนุสัญญาระหว่างประเทศ。ผู้ใช้：โดยไม่คำนึงถึงบุคคลหรือองค์กร、ไม่ว่าจะเป็นผลกำไรหรือไม่、วิธีใช้ (รวมถึงการเรียนรู้และการวิจัย) ทุกคนจำเป็นต้องอ่านข้อตกลงนี้อย่างรอบคอบ เข้าใจ、เห็นด้วย、และปฏิบัติตามข้อกำหนดทั้งหมดของข้อตกลงนี้ สามารถเริ่มใช้ได้เท่านั้น UCenter ซอฟต์แวร์.</p>

<p>ข้อตกลงการอนุญาตนี้ใช้ได้และใช้ได้เฉพาะกับ UCenter 1.x รุ่น ปักกิ่ง Kangsheng Xinchuang Technology Co. , Ltd. มีการตีความขั้นสุดท้ายของข้อตกลงการอนุญาตนี้</p>

<h3>I. สิทธิ์ในการอนุญาตข้อตกลง</h3>
<ol>
<li>คุณสามารถปฏิบัติตามข้อตกลงการอนุญาตผู้ใช้ปลายทางได้อย่างเต็มที่ ใช้ซอฟต์แวร์นี้กับการใช้งานที่ไม่ใช่เชิงพาณิชย์ ไม่จำเป็นต้องชำระค่าธรรมเนียมการอนุญาตลิขสิทธิ์ซอฟต์แวร์</li>
<li>คุณสามารถแก้ไขได้ภายในข้อ จำกัด และข้อ จำกัด ที่ระบุไว้ในข้อตกลง UCenter ซอร์สโค้ด (ถ้ามีให้) หรือสไตล์อินเทอร์เฟซเพื่อตอบสนองความต้องการของเว็บไซต์ของคุณ</li>
<li>คุณมีข้อมูลสมาชิกทั้งหมดในเว็บไซต์ที่สร้างโดยซอฟต์แวร์นี้、บทความและการเป็นเจ้าของข้อมูลที่เกี่ยวข้อง และดำเนินการตามกฎหมายที่เกี่ยวข้องกับเนื้อหาของบทความอย่างอิสระ</li>
<li>หลังจากได้รับอนุญาตเชิงพาณิชย์ คุณสามารถใช้ซอฟต์แวร์นี้เพื่อใช้ในเชิงพาณิชย์ ในเวลาเดียวกันตามระยะเวลาการสนับสนุนทางเทคนิคที่กำหนดในประเภทของประเภทการอนุญาต、วิธีการสนับสนุนทางเทคนิคและเนื้อหาสนับสนุนทางเทคนิค เวลาซื้อเอง ในช่วงระยะเวลาการสนับสนุนทางเทคนิคคุณต้องได้รับบริการสนับสนุนด้านเทคนิคภายในช่วงที่กำหนดผ่านวิธีที่ระบุผู้ใช้การอนุญาตเชิงพาณิชย์เพลิดเพลินไปกับอำนาจในการไตร่ตรองและนำเสนอความคิดเห็น ความคิดเห็นที่เกี่ยวข้องจะได้รับการพิจารณาเป็นครั้งแรก แต่ไม่มีสัญญาหรือรับประกันว่าจะนำมาใช้</li>
</ol>

<h3>II. ข้อ จำกัด และข้อ จำกัด ที่ระบุไว้ในข้อตกลง</h3>
<ol>
<li>ก่อนที่จะได้รับอนุญาตจากธุรกิจ อย่าใช้ซอฟต์แวร์นี้เพื่อวัตถุประสงค์ทางการค้า（รวมถึง แต่ไม่ จำกัด เฉพาะเว็บไซต์ขององค์กร、เว็บไซต์ปฏิบัติการ、เว็บไซต์ที่ใช้กำไรหรือผลกำไร）แก่นแท้โปรดเข้าสู่ระบบหากคุณซื้อการอนุญาตเชิงพาณิชย์http://www.discuz.com คำแนะนำที่เกี่ยวข้องอ้างอิง ยังสามารถโทรได้ 8610-51657885 เรียนรู้เพิ่มเติม.</li>
<li>อย่าเช่าซอฟต์แวร์หรือการอนุญาตทางธุรกิจที่เกี่ยวข้องกับมัน、ขาย、จำนองหรือการออกชุดย่อย</li>
<li>ถึงอย่างไร นั่นคือไม่ว่าจุดประสงค์จะเป็นอย่างไร、ไม่ว่าจะมีการแก้ไขหรือตกแต่งอย่างสวยงาม、ระดับของการปรับเปลี่ยนคืออะไร ใช้เท่านั้น UCenter โดยรวมหรือส่วนใดส่วนหนึ่ง โดยไม่ได้รับอนุญาตเป็นลายลักษณ์อักษร ส่วนท้ายของหน้า UCenter ชื่อและปักกิ่ง Kangsheng Xinchuang Technology Co. , Ltd.（http://www.comsenz.com、http://www.discuz.com หรือ http://www.discuz.net） ลิงก์ทั้งหมดจะต้องเก็บไว้ ไม่สามารถลบหรือแก้ไขได้</li>
<li>ห้าม UCenter ขึ้นอยู่กับส่วนใดส่วนหนึ่งของเวอร์ชันที่ได้รับ、เวอร์ชันที่แก้ไขหรือรุ่นที่สามใช้สำหรับการแจกจ่ายใหม่</li>
<li>หากคุณไม่ปฏิบัติตามข้อกำหนดของข้อตกลงนี้ การอนุญาตของคุณจะถูกยกเลิก สิทธิ์ในการได้รับใบอนุญาตจะถูกนำกลับมา และถือว่าความรับผิดชอบทางกฎหมายที่สอดคล้องกัน</li>
</ol>

<h3>III. การรับประกันแบบ จำกัด และคำแถลงข้อจำกัดความรับผิดชอบ</h3>
<ol>
<li>ซอฟต์แวร์นี้และไฟล์ที่แนบมานั้นมีให้เป็นรูปแบบของการชดเชยหรือการรับประกันที่ไม่ได้ให้ค่าตอบแทนหรือการรับประกันที่ชัดเจนหรือโดยนัย</li>
<li>ผู้ใช้ใช้ซอฟต์แวร์นี้โดยสมัครใจ คุณต้องเข้าใจความเสี่ยงในการใช้ซอฟต์แวร์นี้ ก่อนซื้อบริการด้านเทคนิคผลิตภัณฑ์ เราไม่สัญญาว่าจะให้การสนับสนุนทางเทคนิคในรูปแบบใด ๆ、ใช้การรับประกัน จะไม่รับผิดชอบต่อความรับผิดชอบที่เกี่ยวข้องที่ใช้ซอฟต์แวร์</li>
<li>ปักกิ่ง Kangsheng Xinchuang Technology Co. , Ltd. ไม่รับผิดชอบต่อบทความหรือข้อมูลบนเว็บไซต์ที่สร้างโดยซอฟต์แวร์นี้</li>
</ol>

<p>ที่เกี่ยวข้อง UCenter ข้อตกลงการอนุมัติผู้ใช้ปลายทาง、รายละเอียดของการอนุญาตเชิงพาณิชย์และบริการด้านเทคนิค ทางเลือก UCenter เว็บไซต์อย่างเป็นทางการมีให้เฉพาะปักกิ่ง Kangsheng Xinchuang Technology Co. , Ltd. ยังไม่ได้รับแจ้งล่วงหน้า ปรับเปลี่ยนอำนาจของข้อตกลงการอนุญาตและเครื่องวัดราคาบริการ โปรโตคอลหรือรายการราคาที่แก้ไขจะมีผลกับผู้ใช้ที่ได้รับอนุญาตใหม่นับจากวันที่เปลี่ยนแปลง</p>

<p>ข้อตกลงการอนุญาตของแบบฟอร์มข้อความอิเล็กทรอนิกส์เป็นเหมือนข้อตกลงเป็นลายลักษณ์อักษรที่ลงนามโดยทั้งสองฝ่าย ด้วยผลทางกฎหมายที่สมบูรณ์และเท่าเทียมกันเมื่อคุณเริ่มติดตั้ง UCenter นั่นคือถือว่าเป็นที่เข้าใจอย่างถ่องแท้และยอมรับข้อกำหนดของข้อตกลงนี้ ในขณะที่เพลิดเพลินกับอำนาจที่ได้รับจากข้อบน กิจการและข้อ จำกัดทำหน้าที่นอกขอบเขตของใบอนุญาตข้อตกลง มันจะละเมิดข้อตกลงการอนุญาตนี้โดยตรงและเป็นการละเมิด เรามีสิทธิ์ที่จะยกเลิกการอนุญาตได้ตลอดเวลา เพื่อหยุดความเสียหาย และรักษาอำนาจในการตรวจสอบความรับผิดชอบที่เกี่ยวข้อง</p></div>',

	'uc_installed' => 'คุณได้ติดตั้งแล้ว UCenter หากคุณต้องการติดตั้งใหม่ กรุณาลบ data/install.lock เอกสาร',
	'i_agree' => 'ฉันได้อ่านอย่างระมัดระวัง และเห็นด้วยกับเนื้อหาทั้งหมดของคำสั่งข้างต้น',
	'supportted' => 'รองรับ',
	'unsupportted' => 'ไม่รองรับ',
	'max_size' => 'สนับสนุน/ขนาดใหญ่ที่สุด',
	'project' => 'โครงการ',
	'ucenter_required' => 'UCenter การกำหนดค่าที่จำเป็น',
	'ucenter_best' => 'UCenter เหมาะสมที่สุด',
	'curr_server' => 'เซิร์ฟเวอร์ปัจจุบัน',
	'env_check' => 'การตรวจสอบสิ่งแวดล้อม',
	'os' => 'ระบบปฏิบัติการ',
	'php' => 'PHP รุ่น',
	'attachmentupload' => 'การอัปเดตไฟล์',
	'unlimit' => 'ไม่ จำกัด',
	'version' => 'รุ่น',
	'gdversion' => 'GD ห้องสมุด',
	'allow' => 'อนุญาต ',
	'unix' => 'ใจดีUnix',
	'diskspace' => 'พื้นที่ดิสก์',
	'priv_check' => 'สารบัญ、ตรวจสอบสิทธิ์ไฟล์',
	'func_depend' => 'การพึ่งพาฟังก์ชั่น',
	'func_name' => 'ชื่อฟังก์ชั่น',
	'check_result' => 'ผลการทดสอบ',
	'suggestion' => 'แนะนำ',
	'advice_mysqli' => 'โปรดตรวจสอบ mysqli ไม่ว่าจะมีการโหลดโมดูลอย่างถูกต้อง',
	'advice_fopen' => 'ฟังก์ชั่นนี้ต้องการ php.ini กลาง allow_url_fopen ตัวเลือกเปิดใช้งานกรุณาติดต่อผู้ให้บริการ กำหนดคุณสมบัตินี้',
	'advice_file_get_contents' => 'ฟังก์ชั่นนี้ต้องการ php.ini กลาง allow_url_fopen ตัวเลือกเปิดใช้งานกรุณาติดต่อผู้ให้บริการ กำหนดคุณสมบัตินี้',
	'advice_xml' => 'ฟังก์ชั่นนี้ต้องการ PHP สนับสนุน XML แก่นแท้กรุณาติดต่อผู้ให้บริการ กำหนดคุณสมบัตินี้',
	'none' => 'ไม่มี',

	'dbhost' => 'เซิร์ฟเวอร์ฐานข้อมูล',
	'dbuser' => 'ชื่อผู้ใช้ฐานข้อมูล',
	'dbpw' => 'รหัสผ่านฐานข้อมูล',
	'dbname' => 'ชื่อการจัดเก็บข้อมูล',
	'tablepre' => 'คำนำหน้าตารางข้อมูล',

	'ucfounderpw' => 'รหัสผ่านผู้ก่อตั้ง',
	'ucfounderpw2' => 'ทวนรหัสผ่านซ้ำ',

	'create_table' => 'สร้างตารางข้อมูล',
	'succeed' => 'สำเร็จ ',
);