<?php

/**
 *      [Discuz!] (C)2001-2099 Comsenz Inc.
 *      This is NOT a freeware, use is subject to license terms
 *
 *      $Id: install_lang.php 36287 2016-12-12 03:59:05Z nemohou $ * 
 * 
 *      แปลจากภาษาจีนโดยใช้ Google และ Baidu ในการ Translate 
 *      พร้อมปรับคำให้เข้ากับบริบท โดยละเว้นการแปลตัวแปรอภิธานบัญญัติ
 *      ของระบบเพื่อเลี่ยงการสร้างบัคเพิ่มจากซอฟต์แวร์ต้นฉบับ
 * 
 *      $All new translate Thai lang 2022-11-12 06:53:07GMT nasz$
 */

if(!defined('IN_COMSENZ')) {
	exit('Access Denied');
}

define('UC_VERNAME', '中文版');
$lang = array(
	'SC_UTF8' => 'เวอร์ชัน UTF8 ภาษาจีนตัวย่อ',
	'TC_UTF8' => 'เวอร์ชัน UTF8 ภาษาจีนตัวเต็ม',

	'title_install' => SOFT_NAME.' คู่มือการติดตั้ง',
	'agreement_yes' => 'ยอมรับ',
	'agreement_no' => 'ไม่ยอมรับ',
	'notset' => 'ไม่กำหนด',
	'enable' => 'enable',
	'disable' => 'disable',

	'message_title' => 'แจ้งข้อมูล',
	'error_message' => 'เกิดผิดพลาด',
	'message_return' => 'ย้อนกลับ',
	'return' => 'ย้อนกลับ',
	'install_wizard' => 'คู่มือการติดตั้ง',
	'config_nonexistence' => 'ไม่มีไฟล์กำหนดค่า',
	'nodir' => 'ไดเรกทอรีไม่มีอยู่จริง',
	'redirect' => 'เบราว์เซอร์จะเปลี่ยนหน้าโดยอัตโนมัติ<br>หากเบราว์เซอร์ของคุณไม่เปลี่ยนหน้าโดยอัตโนมัติโปรดคลิกที่นี่',
	'auto_redirect' => 'เบราว์เซอร์จะเปลี่ยนหน้าโดยอัตโนมัติ',
	'database_errno_1064' => 'SQL เกิดข้อผิดพลาดทางไวยากรณ์',

	'dbpriv_createtable' => 'ขาดสิทธิ์ในการ CREATE TABLE ไม่สามารถติดตั้งต่อได้',
	'dbpriv_insert' => 'ขาดสิทธิ์ในการ INSERT ไม่สามารถติดตั้งต่อได้',
	'dbpriv_select' => 'ขาดสิทธิ์ในการ SELECT ไม่สามารถติดตั้งต่อได้',
	'dbpriv_update' => 'ขาดสิทธิ์ในการ UPDATE ไม่สามารถติดตั้งต่อได้',
	'dbpriv_delete' => 'ขาดสิทธิ์ในการ DELETE ไม่สามารถติดตั้งต่อได้',
	'dbpriv_droptable' => 'ขาดสิทธิ์ในการ DROP TABLE ไม่สามารถติดตั้งต่อได้',

	'db_not_null' => 'ฐานข้อมูล UCenter มีข้อมูลอยู่ก่อนแล้ว, การดำเนินติดตั้งต่อจะล้างข้อมูลเดิมทั้งหมด',
	'db_drop_table_confirm' => 'การไปต่อจะล้างข้อมูลเดิมทั้งหมด คุณแน่ใจหรือไม่ว่าต้องการดำเนินการ?',

	'writeable' => 'เขียนทับได้',
	'unwriteable' => 'เขียนทับไม่ได้',
	'old_step' => 'ก่อนหน้า',
	'new_step' => 'ขั้นตอนต่อไป',

	'database_errno_2003' => 'ไม่สามารถเชื่อมต่อกับฐานข้อมูลได้ โปรดตรวจสอบว่าฐานข้อมูลได้เริ่มต้นแล้วหรือไม่ และที่อยู่เซิร์ฟเวอร์ฐานข้อมูลนั้นถูกต้อง',
	'database_errno_1044' => 'ไม่สามารถสร้างฐานข้อมูลใหม่ได้ โปรดตรวจสอบว่าได้กรอกข้อมูลของฐานข้อมูลอย่างถูกต้องแล้วหรือไม่',
	'database_errno_1045' => 'ไม่สามารถเชื่อมต่อกับฐานข้อมูลได้ โปรดตรวจสอบว่าชื่อผู้ใช้ฐานข้อมูลหรือรหัสผ่านนั้นถูกต้องแล้วหรือไม่',
	'database_connect_error' => 'เกิดข้อผิดพลาดในการเชื่อมต่อฐานข้อมูล',

	'step_title_1' => 'ตรวจสอบสภาพแวดล้อม',
	'step_title_2' => 'ดำเนินงานปรับสภาพแวดล้อม',
	'step_title_3' => 'สร้างฐานข้อมูล',
	'step_title_4' => 'ติดตั้ง',
	'step_env_check_title' => 'เริ่มการติดตั้ง',
	'step_env_check_desc' => 'การตรวจสอบสภาพแวดล้อม สิทธิ์การใช้งานไฟล์และไดเรกทอรี',
	'step_db_init_title' => 'ติดตั้งฐานข้อมูล',
	'step_db_init_desc' => 'กำหนดค่าในการติดตั้งฐานข้อมูล',

	'step1_file' => 'ไฟล์ไดเรกทอรี',
	'step1_need_status' => 'สถานะที่จำเป็น',
	'step1_status' => 'สถานะปัจจุบัน',
	'not_continue' => 'โปรดแก้ไขตามแนะนำสีแดงด้านบนแล้วลองใหม่อีกครั้ง',

	'tips_dbinfo' => 'กรอกข้อมูลของฐานข้อมูล',
	'tips_dbinfo_comment' => '',
	'tips_admininfo' => 'กรอกข้อมูลผู้ดูแลระบบ',
	'step_ext_info_title' => 'การติดตั้งที่ประสบความสำเร็จ',
	'step_ext_info_comment' => 'คลิกเพื่อเข้าสู่ระบบ',

	'ext_info_succ' => 'การติดตั้งที่ประสบความสำเร็จ',
	'install_submit' => 'ส่ง',
	'install_locked' => 'การติดตั้งถูกล็อค หากคุณมั่นใจว่าต้องติดตั้งใหม่อีกครั้งโปรดลบไฟล์ต่อไปนี้บนเซิร์ฟเวอร์ออกก่อน<br /> ' . str_replace(ROOT_PATH, '', $lockfile),
	'error_stuck_msg' => 'การติดตั้งไม่มีความคืบหน้าเป็นเวลานาน เป็นไปได้ว่าคำขอที่เกี่ยวข้องผิดพลาด หรือหมดอายุ หรืออาจเกิดจากข้อผิดพลาดที่ร้ายแรงกับเครือข่ายเซิร์ฟเวอร์',
	'error_quit_msg' => 'คุณต้องแก้ปัญหาข้างต้นก่อนจึงจะสามารถดำเนินการติดตั้งขั้นตอนต่อไปได้',

	'step_app_reg_title' => 'ดำเนินงานปรับสภาพแวดล้อม',
	'step_app_reg_desc' => 'ตรวจจับสภาพแวดล้อมและการตั้งค่าเซิร์ฟเวอร์ UCenter',
	'tips_ucenter' => 'กรุณากรอกข้อมูล UCenter Server ที่เกี่ยวข้อง',
	'tips_ucenter_comment' => 'UCenter เป็นโปรแกรมบริการหลักของผลิตภัณฑ์ Comsenz การติดตั้งและใช้งาน Discuz! Board จำเป็นต้องใช้โปรแกรมนี้
หากคุณติดตั้ง UCenter ไว้แล้วกรุณากรอกข้อมูลต่อไปนี้ให้ครบถ้วน หากยังไม่ได้ติดตั้ง กรุณาไปที่ <a href="http://www.discuz.com/" target="blank">ศูนย์ผลิตภัณฑ์ Comsenz</a> ดาวน์โหลดและติดตั้ง ก่อนที่จะดำเนินการขั้นถัดไป',

	'advice_mysqli_connect' => 'โปรดตรวจสอบ mysqli ว่าได้มีการโหลดโมดูลอย่างถูกต้องหรือไม่',
	'advice_xml_parser_create' => 'ต้องการ PHP ที่สนับสนุนฟังก์ชั่น XML กรุณาติดต่อผู้ให้บริการโฮสติ้งเพื่อเปิดใช้งาน',
	'advice_json_encode' => 'ต้องการ PHP ที่สนับสนุนฟังก์ชั่น JSON กรุณาติดต่อผู้ให้บริการโฮสติ้งเพื่อเปิดใช้งาน',
	'advice_fsockopen' => 'ต้องการการกำหนดค่าใน php.ini ให้ allow_url_fopen เปิดใช้งาน กรุณาติดต่อผู้ให้บริการโฮสติ้งเพื่อเปิด',
	'advice_pfsockopen' => 'ต้องการการกำหนดค่าใน php.ini ให้ allow_url_fopen เปิดใช้งาน กรุณาติดต่อผู้ให้บริการโฮสติ้งเพื่อเปิด',
	'advice_stream_socket_client' => 'ต้องการการกำหนดค่าใน php.ini ให้ stream_socket_client เปิดใช้งาน กรุณาติดต่อผู้ให้บริการโฮสติ้งเพื่อเปิด',
	'advice_curl_init' => 'ต้องการการกำหนดค่าใน php.ini ให้ curl_init เปิดใช้งาน กรุณาติดต่อผู้ให้บริการโฮสติ้งเพื่อเปิด',

	'ucurl' => 'URL ของ UCenter',
	'ucpw' => 'รหัสผ่านผู้ก่อตั้ง UCenter',
	'ucip' => 'ที่อยู่ IP ของ UCenter',
	'ucenter_ucip_invalid' => 'เกิดข้อผิดพลาด รูปแบบของที่อยู่ IP ไม่ถูกต้อง โปรดกรอกให้ถูกต้อง',
	'ucip_comment' => 'ใช้ในบางกรณี ส่วนใหญ่คุณไม่จำเป็นต้องกรอกข้อมูลก็ได้',

	'tips_siteinfo' => 'กรุณากรอกข้อมูลเว็บไซต์',
	'sitename' => 'ชื่อไซต์',
	'siteurl' => 'URL เว็บไซต์',

	'forceinstall' => 'การบังคับติดตั้ง',
	'dbinfo_forceinstall_invalid' => 'ฐานข้อมูลปัจจุบันมีตารางข้อมูลและคำนำหน้าแบบเดียวกันอยู่ คุณสามารถแก้ไข "คำนำหน้าตารางข้อมูล" เพื่อหลีกเลี่ยงการลบข้อมูลเก่า หรือ เลือกการติดตั้งแบบบังคับติดตั้ง การติดตั้งแบบบังคับจะลบข้อมูลเก่าและไม่สามารถกู้คืนได้อีก',

	'click_to_back' => 'คลิกเพื่อกลับไปยังเพจก่อนหน้า',
	'adminemail' => 'Email ของผู้ดูแลระบบ',
	'adminemail_comment' => 'ใช้เพื่อส่งรายงานข้อผิดพลาดของโปรแกรม',
	'dbhost_comment' => 'โดยทั่วไปเป็น 127.0.0.1 หรือ localhost',
	'dbname_comment' => 'สำหรับการติดตั้งฐานข้อมูล Discuz!',
	'dbuser_comment' => 'ชื่อผู้ใช้ฐานข้อมูลของคุณ',
	'dbpw_comment' => 'รหัสผ่านฐานข้อมูลของคุณ',
	'tablepre_comment' => 'เมื่อต้องใช้หลายฟอรั่มในฐานข้อมูลเดียวกันโปรดแก้ไขคำนำหน้านี้',
	'forceinstall_check_label' => 'ฉันต้องการลบข้อมูลและบังคับการติดตั้ง !!!',
	'initdbresult_succ' => 'การติดตั้งฐานข้อมูลเสร็จสมบูรณ์',
	'initsys' => 'การเริ่มต้นระบบ',

	'uc_url_empty' => 'คุณไม่ได้กรอกที่อยู่ URL ของ UCenter โปรดกลับไปกรอก',
	'uc_url_invalid' => 'รูปแบบที่อยู่ URL ผิด',
	'uc_url_unreachable' => 'คุณอาจกรอกที่อยู่ URL ของ UCenter ผิดพลาดโปรดตรวจสอบ',
	'uc_ip_invalid' => 'ที่อยู่ IP ผิด ไม่สามารถแยกวิเคราะห์ชื่อโดเมนของเว็บไซต์นี้ได้ โปรดตรวจสอบข้อมูลที่กรอก',
	'uc_admin_invalid' => 'UCenter การตรวจสอบรหัสผ่านของผู้ก่อตั้งไม่ได้รับการอนุมัติ, เหตุผลที่เป็นไปได้:<br />1. UCenter รหัสผ่านของผู้ก่อตั้งไม่ถูกต้อง<br />2. รหัสผ่านอินพุตหลายข้อผิดพลาดนำไปสู่ผู้ใช้ของผู้ก่อตั้งและ IP ที่อยู่ถูกล็อค<br />3. UCenter หลังเวที “ ผ่าน URL เพิ่มฟังก์ชั่นแอปพลิเคชัน ” ยังไม่ได้เปิด',
	'uc_data_invalid' => 'การสื่อสารล้มเหลวโปรดตรวจสอบ UCenter 的URL ไม่ว่าที่อยู่จะถูกต้อง ',
	'uc_dbcharset_incorrect' => 'UCenter อักขระฐานข้อมูลไม่สอดคล้องกับชุดอักขระแอปพลิเคชันปัจจุบัน',
	'uc_api_add_app_error' => 'ต่อ UCenter เพิ่มข้อผิดพลาดของแอปพลิเคชัน',
	'uc_dns_error' => 'UCenter ข้อผิดพลาดในการวิเคราะห์ DNS โปรดกลับไปเติมเต็ม UCenter 的 ที่อยู่ IP',

	'ucenter_ucurl_invalid' => 'ที่อยู่ URL ของ UCenter ว่างเปล่าหรือรูปแบบผิดโปรดตรวจสอบ',
	'ucenter_ucpw_invalid' => 'รหัสผ่านของผู้ก่อตั้ง UCenter ว่างเปล่าหรือรูปแบบผิดโปรดตรวจสอบ',
	'siteinfo_siteurl_invalid' => 'URL ของไซต์ว่างเปล่าหรือรูปแบบผิดโปรดตรวจสอบ',
	'siteinfo_sitename_invalid' => 'ชื่อไซต์ว่างเปล่าหรือรูปแบบผิดโปรดตรวจสอบ',
	'dbinfo_dbhost_invalid' => 'เซิร์ฟเวอร์ฐานข้อมูลว่างเปล่าหรือรูปแบบผิดโปรดตรวจสอบ',
	'dbinfo_dbname_invalid' => 'ชื่อฐานข้อมูลว่างเปล่าหรือรูปแบบผิดโปรดตรวจสอบ',
	'dbinfo_dbuser_invalid' => 'ชื่อผู้ใช้ฐานข้อมูลว่างเปล่าหรือรูปแบบผิดโปรดตรวจสอบ',
	'dbinfo_dbpw_invalid' => 'รหัสผ่านฐานข้อมูลว่างเปล่าหรือรูปแบบผิดโปรดตรวจสอบ',
	'dbinfo_adminemail_invalid' => 'กล่องจดหมายของระบบว่างเปล่าหรือรูปแบบผิดโปรดตรวจสอบ',
	'dbinfo_tablepre_invalid' => 'คำนำหน้าตารางข้อมูลว่างเปล่าหรือรูปแบบผิดโปรดตรวจสอบ',
	'admininfo_username_invalid' => 'ชื่อผู้ใช้ของผู้ดูแลระบบว่างเปล่าหรือรูปแบบผิดโปรดตรวจสอบ',
	'admininfo_email_invalid' => 'อีเมลของผู้ดูแลระบบว่างเปล่าหรือรูปแบบผิดโปรดตรวจสอบ',
	'admininfo_password_invalid' => 'รหัสผ่านของผู้ดูแลระบบว่างเปล่าโปรดกรอกข้อมูล',
	'admininfo_password2_invalid' => 'รหัสผ่านทั้งสองอันไม่เหมือนกันโปรดตรวจสอบ',

	'install_dzfull' => '<div class="selradio"><input type="radio" id="install_ucenter_yes"' . (getgpc('install_ucenter') != 'no' ? ' checked="checked"' : '') . ' name="install_ucenter" value="yes" onclick="if(this.checked)$(\'form_items_2\').style.display=\'none\';" /><label for="install_ucenter_yes">ติดตั้ง Discuz! X ใหม่หมด (พร้อมด้วย UCenter Server)</label></div>',
	'install_dzonly' => '<div class="selradio"><input type="radio" id="install_ucenter_no"' . (getgpc('install_ucenter') == 'no' ? ' checked="checked"' : '') . ' name="install_ucenter" value="no" onclick="if(this.checked)$(\'form_items_2\').style.display=\'\';" /><label for="install_ucenter_no">ติดตั้งเฉพาะ Discuz! X เท่านั้น (มี UCenter Server อยู่ก่อนแล้ว)</label></div>',

	'username' => 'บัญชีผู้ดูแลระบบ',
	'email' => 'Email ของผู้ดูแลระบบ',
	'password' => 'รหัสผ่านผู้ดูแลระบบ',
	'password_comment' => 'รหัสผ่านของผู้ดูแลระบบไม่สามารถว่างได้',
	'password2' => 'ทวนรหัสผ่านซ้ำอีกครั้ง',

	'admininfo_invalid' => 'ข้อมูลของผู้ดูแลระบบไม่สมบูรณ์ โปรดตรวจสอบบัญชีผู้ดูและระบบรหัสผ่านกล่องจดหมาย',
	'dbname_invalid' => 'ชื่อฐานข้อมูลว่างเปล่าโปรดกรอกชื่อฐานข้อมูล',
	'tablepre_invalid' => 'คำนำหน้าตารางข้อมูลว่างเปล่าหรือรูปแบบผิดโปรดตรวจสอบ',
	'admin_username_invalid' => 'ชื่อผู้ใช้ที่ผิดกฎหมายความยาวชื่อผู้ใช้ไม่ควรเกินกว่า 15 ตัวละครภาษาอังกฤษและไม่สามารถมีอักขระพิเศษโดยทั่วไปภาษาจีนตัวอักษรหรือตัวเลข',
	'admin_password_invalid' => 'รหัสผ่านทั้งสองอันไม่เหมือนกันโปรดกลับมาอีกครั้ง',
	'admin_email_invalid' => 'ที่อยู่ Email ไม่ถูกต้อง ที่อยู่อีเมลนี้ถูกใช้แล้วหรือรูปแบบไม่ถูกต้อง โปรดแทนที่ด้วยที่อยู่อื่น',
	'admin_invalid' => 'ข้อมูลผู้ดูแลข้อมูลของคุณไม่ได้กรอกไว้อย่างสมบูรณ์โปรดกรอกข้อมูลในแต่ละโครงการอย่างรอบคอบ',
	'admin_exist_password_error' => 'ผู้ใช้มีอยู่แล้วหากคุณต้องการตั้งค่าผู้ใช้นี้เป็นผู้ดูแลระบบฟอรั่มโปรดป้อนรหัสผ่านของผู้ใช้อย่างถูกต้องหรือเปลี่ยนชื่อของชื่อผู้ดูแลฟอรั่ม',

	'tagtemplates_subject' => 'ชื่อ',
	'tagtemplates_uid' => 'ID ผู้ใช้',
	'tagtemplates_username' => 'โพสต์โดย',
	'tagtemplates_dateline' => 'วันที่',
	'tagtemplates_url' => 'ที่อยู่แม่แบบ',

	'uc_version_incorrect' => 'เซิร์ฟเวอร์ UCenter ของคุณเป็นเวอร์ชั่นที่ต่ำเกินไปโปรดอัปเกรด เซิร์ฟเวอร์ UCenter เป็นเวอร์ชันล่าสุด ดาวน์โหลดได้ที่: https://discuz.chat',
	'config_unwriteable' => 'ตัวช่วยการติดตั้งไม่สามารถเขียนไฟล์ได้ ได้โปรดกำหนดค่าแอตทริบิวต์การเขียนไฟล์ config.inc.php ของโปรแกรมให้เขียนได้ -สถานะที่สามารถใช้งานได้(777)',

	'install_in_processed' => 'กำลังติดตั้ง...',
	'install_succeed' => 'การติดตั้งที่ประสบความสำเร็จคลิกเพื่อเข้าสู่',

	'init_credits_karma' => 'ศักดิ์ศรี',
	'init_credits_money' => 'เงิน',

	'init_postno0' => 'เจ้าบ้าน',
	'init_postno1' => 'โซฟา',
	'init_postno2' => 'ม้านั่ง',
	'init_postno3' => 'พื้น',

	'init_support' => 'สนับสนุน',
	'init_opposition' => 'คัดค้าน',

	'init_group_0' => 'สมาชิก',
	'init_group_1' => 'ผู้ดูแลระบบ',
	'init_group_2' => 'ผู้ดูแลฟอรั่ม',
	'init_group_3' => 'ผู้ดำเนินรายการ',
	'init_group_4' => 'ถูกห้ามพูด',
	'init_group_5' => 'ถูกห้ามเข้า',
	'init_group_6' => 'ถูกห้ามจาก IP',
	'init_group_7' => 'นักท่องเที่ยว',
	'init_group_8' => 'กำลังรอการตรวจสอบการเป็นสมาชิก',
	'init_group_9' => 'เร่ร่อน',
	'init_group_10' => 'มือใหม่',
	'init_group_11' => 'สมาชิกลงทะเบียน',
	'init_group_12' => 'สมาชิกระดับกลาง',
	'init_group_13' => 'สมาชิกอาวุโส',
	'init_group_14' => 'สมาชิกทองคำ',
	'init_group_15' => 'ผู้ทรงคุณวุฒิ',

	'init_rank_1' => 'น้องใหม่',
	'init_rank_2' => 'อนุบาล ก.ไก่',
	'init_rank_3' => 'นักเขียนฝึกหัด',
	'init_rank_4' => 'นักเขียนอิสระ',
	'init_rank_5' => 'นักเขียนพิเศษ',

	'init_cron_1' => 'การชำระล้างจำนวนนับของวันนี้',
	'init_cron_2' => 'การชำระล้างเวลาออนไลน์ของเดือนนี้',
	'init_cron_3' => 'การชำระชำระล้างข้อมูลรายวัน',
	'init_cron_4' => 'สถิติวันเกิดและการอวยพรทางอีเมล',
	'init_cron_5' => 'การแจ้งเตือนเมื่อมีการตอบกลับกระทู้',
	'init_cron_6' => 'การชำระล้างกระดานข่าวรายวัน',
	'init_cron_7' => 'การชำระล้างข้อมูลกิจกรรมที่จำกัดเวลา',
	'init_cron_8' => 'การชำระล้างข้อมูลโปรโมชั่นของฟอรั่ม',
	'init_cron_9' => 'การชำระล้างธีมรายเดือน',
	'init_cron_10' => 'สมาชิคที่อัพเดท X-Space รายวัน',
	'init_cron_11' => 'การอัปเดตธีมโมโน',

	'init_bbcode_1' => 'ทำให้เนื้อหาผลัดม้วนเปลี่ยนในแนวนอน เอฟเฟกต์นี้คล้ายกัน marquee ของ HTML ข้อสังเกตุ: เอฟเฟกต์นี้จะมีเฉพาะในเบราว์เซอร์ Internet Explorer เท่านั้นที่แสดงผลอย่างถูกต้อง',
	'init_bbcode_2' => 'ฝังแอนิเมชั่น Flash',
	'init_bbcode_3' => 'แสดงสถานะออนไลน์ของ QQ คลิกไอคอนนี้เพื่อแชทกับเขาหรือเธอ',
	'init_bbcode_4' => 'ตัวยก',
	'init_bbcode_5' => 'ตัวห้อย',
	'init_bbcode_6' => 'ฝังเสียง Windows media',
	'init_bbcode_7' => 'ฝังเสียงหรือวิดีโอ Windows media',

	'init_qihoo_searchboxtxt' => 'ป้อนคีย์เวิร์ด,ค้นหาอย่างรวดเร็วของฟอรั่มนี้',
	'init_threadsticky' => 'ระดับโลก,หมวดหมู่,รุ่นนี้',

	'init_default_style' => 'รูปแบบเริ่มต้น',
	'init_default_forum' => 'หมวดเริ่มต้น',
	'init_default_template' => 'ชุดเทมเพลตเริ่มต้น',
	'init_default_template_copyright' => 'บริษัท เทนเซ็นต์คลาวด์คอมพิวติ้ง (ปักกิ่ง) จำกัด',

	'init_dataformat' => 'Y-n-j',
	'init_modreasons' => 'โฆษณา/SPAM\r\nเนื้อหาหลอกลวง\r\nเนื้อหาที่ผิดกฎหมาย\r\nข้อความผิดคำถาม\r\n โพสต์ซ้ำ\r\n\r\ฉันเห็นด้วยกับมันมาก\r\บทความบูติก\r\n เนื้อหาต้นฉบับ',
	'init_userreasons' => 'เจ๋ง!\r\nทุกอย่างไม่มีอะไรเลย\r\nให้มันชอบ!\r\nเลียนแบบ\r\nความสงบ',
	'init_link' => 'ฟอรั่มอย่างเป็นทางการของ Discuz!',
	'init_link_note' => 'เวอร์ชั่นล่าสุดของ Discuz! ข่าวผลิตภัณฑ์ การดาวน์โหลดซอฟต์แวร์ และ การแลกเปลี่ยนทางเทคนิค',

	'init_promotion_task' => 'งานโปรโมตเว็บไซต์',
	'init_gift_task' => 'งานซองของขวัญสีแดง',
	'init_avatar_task' => 'งานรูปภาพประจำตัว',

	'copyright' => 'สงวนลิขสิทธิ์ &copy; 2001-'.date('Y'). ' เทนเซ็นต์คลาวด์',

	'license' => '
<div class="license"><h1>ข้อตกลงใช้งานเวอร์ชั่นแปลไทยจากต้นฉบับภาษาจีนตัวย่อ</h1>
<p>สงวนลิขสิทธิ์ &copy; 2001-' . date('Y') . '，บริษัท เทนเซ็นต์คลาวด์คอมพิวติ้ง (ปักกิ่ง) จำกัด (เดิมชื่อ บริษัท ปักกิ่ง คังเชิง ซินชวง เทคโนโลยี จำกัด) ผู้เป็นเจ้าของผลิตภัณฑ์ (ต่อไปนี้เรียกว่า "<strong>เทนเซ็นต์คลาวด์</strong>") </p>

<p>สงวนลิขสิทธิ์ &copy; 2008-' . date('Y') . '，เว็บไซต์ดิสคัซไซนซ์ ผู้บรรยายไทย (ต่อไปนี้เรียกว่า "<strong>ผู้แปล</strong>")</p>

<p>ขอบคุณสำหรับการเลือกผลิตภัณฑ์ของเทนเซ็นต์คลาวด์ เราหวังว่าความพยายามของเราจะช่วยให้คุณมีโซลูชันเว็บไซต์ที่มีประสิทธิภาพ รวดเร็ว และ ทรงพลัง เว็บไซต์อย่างเป็นทางการของเทนเซ็นต์คลาวด์คือ https://www.qcloud.com เว็บไซต์ชุมชนและพื้นที่การสนทนาอย่างเป็นทางการคือ https://www.dismall.com เว็บไซต์ศูนย์รวมส่วนเสริมและแอปพลิเคชั่นอย่างเป็นทางการของผลิตภัณฑ์คือ https://addon.dismall.com เว็บไซต์โอเพ่นซอร์สคือ https://code.dismall.com เว็บไซต์ของผู้แปลไทย https://discuzxync.com</p>

<p>ผลิตภัณฑ์เทนเซนคลาว Discuz! X มีศูนย์รวมส่วนเสริมและแอปพลิเคชั่นอย่างเป็นทางการของโครงการ ดำเนินการโดย บริษัท เหอเฟย์ อาดาว เน็ตเวิร์ค เทคโนโลยี จำกัด โครงการโอเพ่นซอร์สดำเนินการและดูแลโดย บริษัท เหอเฟย์ อาดาว เน็ตเวิร์ค เทคโนโลยี จำกัด โอเพ่นซอร์สโค้ดของ Discuz! X ได้รับการดูแลร่วมกันโดยคณะกรรมการบริหารโครงการโอเพ่นซอร์สและชุมชนนักพัฒนา นอกจากบริการข้างต้นแล้ว บริการทั้งหมดจัดทำโดยเทนเซนคลาว</p>

<p>ประกาศถึงผู้ใช้งาน：ข้อตกลงนี้เป็นข้อตกลงที่มีผลผูกพันทางกฎหมายระหว่าง "คุณ" กับ "เทนเซนคลาว" เกี่ยวกับการใช้ผลิตภัณฑ์ซอฟต์แวร์ และ บริการต่าง ๆ ที่จัดหาโดยบริษัทเทนเซนคลาว ไม่ว่าคุณจะเป็น บุคคล หรือ องค์กร ไม่ว่าแสดงหาผลกำไรหรือไม่ การใช้งาน (รวมทั้งเพื่อการศึกษาและการวิจัย) คุณต้องอ่านรายละเอียดข้อตกลงนี้อย่างระมัดระวังและรอบคอบ รวมถึงข้อยกเว้นหรือการปฏิเสทความรับผิดชอบของเทนเซนคลาว และ ข้อจำกัดเกี่ยวกับสิทธิ์ของคุณ โปรดตรวจสอบและยอมรับข้อตกลงของบริการนี้ หากคุณไม่เห็นด้วยกับเนื้อหาในข้อตกลงหรือเงื่อนไขการให้บริการนี้ และ/หรือ การที่เทนเซนคลาวสามารถเปลี่ยนแปลงข้อตกลงเมื่อไดก็ได้ คุณไม่ควรใช้หรือเยี่ยมชมผลิตภัณฑ์หรือบริการที่ให้บริการโดยเทนเซนคลาว การลงทะเบียน เข้าสู่ระบบ ดาวน์โหลด การใช้บริการผลิตภัณฑ์ ไม่ว่าพฤติกรรมได ๆ ที่เกี่ยวข้องกับเทนเซนคลาว จะถือว่าเป็นการยอมรับโดยสมบูรณ์ตามข้อตกลงและเงื่อนไขการบริการในหน้านี้ รวมไปถึงการยอมรับในสิทธิ์ของเทนเซนคลาวที่สามารถแก้ไขข้อตกลงและเงื่อนไขการบริการนี้ได้ตลอดเวลา</p>
<p>เมื่อมีการเปลี่ยนแปลงข้อกำหนดและเงื่อนไขการให้บริการ เทนเซนคลาวจะประกาศเนื้อหาการแก้ไขบนเว็บไซต์ ข้อกำหนดและเงื่อนไขการให้บริการเดิมจะถูกแทนที่ทันทีเมื่อประกาศถูกโพสต์เผยแพร่บนเว็บไซต์อย่างเป็นทางการของเทนเซนคลาว คุณสามารถเยื่ยมชมฟอรั่มอย่างเป็นทางการของเทนเซนคลาว เพื่อตรวจสอบข้อกำหนดและเงื่อนไขการให้บริการฉบับล่าสุดได้ตลอดเวลา หากคุณเลือกยอมรับข้อกำหนดเหล่านี้ นั่นหมายความว่าคุณตกลงที่จะผูกพันตามเงื่อนไขของข้อตกลง หากคุณไม่เห็นด้วยกับข้อกำหนดในการให้บริการเหล่านี้ คุณไม่มีสิทธิ์ที่จะใช้บริการเทนเซนคลาว หากคุณฝ่าฝืนบทบัญญัติของข้อตกลงนี้ เทนเซนคลาวมีสิทธิ์ที่จะระงับหรือยกเลิกการใช้ผลิตภัณฑ์เทนเซนคลาวได้ตลอดเวลา และ ขอสงวนสิทธิ์ในการรับผิดชอบทางกฎหมายที่เกี่ยวข้อง</p>
<p>หลังจากทำความเข้าใจ เห็นด้วย และ ปฏิบัติตามเงื่อนไขทั้งหมดของข้อตกลงนี้แล้ว ก่อนที่คุณจะเริ่มใช้ผลิตภัณฑ์เทนเซนคลาว คุณสามารถทำข้อตกลงเป็นลายลักษณ์อักษรได้โดยตรงกับเทนเซนคลาว เพื่อเสริม หรือ แทนที่ทั้งหมด หรือ ส่วนใดส่วนหนึ่งของข้อตกลงนี้</p>

<p>เทนเซนคลาวเป็นเจ้าของสิทธิ์ทรัพย์สินทางปัญญาทั้งหมดของซอฟต์แวร์นี้ คุณสามารถใช้ซอฟต์แวร์นี้ได้ภายใต้ข้อตกลงตามใบอนุญาตนี้เท่านั้น ห้ามจำหน่าย เทนเซนคลาวอนุญาตให้คุณทำซ้ำ ดาวน์โหลด ติดตั้ง ใช้งาน หรือ รับประโยชน์จากการทำงานของซอฟต์แวร์ หรือ สิทธิ์ในทรัพย์สินทางปัญญาในลักษณะอื่น ๆ เมื่อคุณยังปฏิบัติตามข้อกำหนดและเงื่อนไขการให้บริการนี้เท่านั้น</p>

<h3>I. สิทธิ์ในการอนุญาตข้อตกลง</h3>
<ol>
   <li>คุณสามารถใช้ซอฟต์แวร์นี้กับการใช้งานที่ไม่ใช่เชิงพาณิชย์หรือการใช้งานเชิงพาณิชย์บนพื้นฐานของการปฏิบัติตามข้อตกลงใบอนุญาตนี้อย่างเต็มที่ (จำกัด เฉพาะการอนุญาตของข้อตกลงนี้) โดยไม่ต้องจ่ายค่าธรรมเนียมใบอนุญาตลิขสิทธิ์ซอฟต์แวร์</li>
   <li>คุณสามารถแก้ไขซอร์สโค้ดของผลิตภัณฑ์คลาวด์ Tencent (ถ้ามี) หรือสไตล์อินเทอร์เฟซตามเงื่อนไข และ ข้อจำกัด ที่ระบุไว้ในข้อตกลงเพื่อตอบสนองความต้องการของเว็บไซต์ของคุณ</li>
   <li>คุณมีความเป็นเจ้าของข้อมูลการเป็นสมาชิกบทความและข้อมูลที่เกี่ยวข้องทั้งหมดในเว็บไซต์ที่สร้างโดยซอฟต์แวร์นี้และเป็นอิสระจากการตรวจสอบและภาระผูกพันของเนื้อหาเว็บไซต์ที่สร้างโดยซอฟต์แวร์นี้เพื่อให้แน่ใจว่าพวกเขาจะไม่ละเมิดสิทธิ์และความสนใจที่ถูกต้องตามกฎหมาย ของใครก็ตามและเป็นสาเหตุของสาเหตุของความรับผิดชอบทั้งหมดที่เกิดจากซอฟต์แวร์และบริการคลาวด์ของ Tencent หาก บริษัท Tencent Cloud หรือการสูญเสียของผู้ใช้เกิดขึ้นคุณควรจ่ายค่าตอบแทนทั้งหมด</li>
   <li>หากคุณต้องการใช้ซอฟต์แวร์หรือบริการคลาวด์ Tencent เพื่อวัตถุประสงค์ทางการค้าคุณต้องปฏิบัติตามกฎหมายที่เกี่ยวข้องของสาธารณรัฐประชาชนจีนหากคุณต้องการให้การสนับสนุนด้านเทคนิคหรือการสนับสนุนทางเทคนิคโปรดให้บริการสนับสนุนด้านเทคนิคแก่ศูนย์แอปพลิเคชันอย่างเป็นทางการ (https://addon.dismall.com/service.html)</li>
   <li>คุณสามารถดาวน์โหลดแอปพลิเคชันที่เหมาะสมสำหรับเว็บไซต์ของคุณจากบริการ Application Center ที่จัดทำโดย Tencent Cloud แต่คุณควรจ่ายค่าธรรมเนียมที่สอดคล้องกันให้กับผู้พัฒนา/เจ้าของแอปพลิเคชัน</li>
</ol>

<h3>II. 协议规定的约束和限制</h3>
<ol>
   <li>不得对本软件或与之关联的商业授权进行出租、出售、抵押或发放子许可证。</li>
   <li>无论如何，即无论用途如何、是否经过修改或美化、修改程度如何，只要使用腾讯云产品的整体或任何部分，未经书面许可，页面页脚处的腾讯云产品名称和腾讯云公司下属网站（http://cloud.tencent.com 或 https://www.discuz.net） 及程序后台官方应用中心的链接（https://addon.dismall.com）都必须保留，而不能清除或修改、替换。</li>
   <li>禁止在腾讯云产品的整体或任何部分基础上以发展任何派生版本、修改版本或第三方版本用于重新分发。</li>
   <li>您从应用中心下载的应用程序，未经应用程序开发者/所有者的书面许可，不得对其进行反向工程、反向汇编、反向编译等，不得擅自复制、修改、链接、转载、汇编、发表、出版、发展与之有关的衍生产品、作品等。</li>
   <li>如果您未能遵守本协议的条款，您的授权将被终止，所许可的权利将被收回，同时您应承担相应法律责任。</li>
</ol>

<h3>III. 有限担保和免责声明</h3>
<ol>
   <li>本软件及所附带的文件是作为不提供任何明确的或隐含的赔偿或担保的形式提供的。</li>
   <li>用户出于自愿而使用本软件，您必须了解使用本软件的风险，我们不承诺提供任何形式的技术支持、使用担保，也不承担任何因使用本软件而产生问题的相关责任。</li>
   <li>腾讯云公司不对使用本软件构建的网站中或者论坛中的文章或信息承担责任，全部责任由您自行承担。</li>
   <li>官方应用中心无法全面监控由第三方上传至应用中心的应用程序，因此不保证应用程序的合法性、安全性、完整性、真实性或品质等；您从应用中心下载应用程序时，同意自行判断并承担所有风险，而不依赖于腾讯云公司及官方应用中心。但在任何情况下，官方应用中心有权依法停止应用中心服务并采取相应行动，包括但不限于对于相关应用程序进行卸载，暂停服务的全部或部分，保存有关记录，并向有关机关报告。由此对您及第三人可能造成的损失，腾讯云公司及官方应用中心不承担任何直接、间接或者连带的责任。</li>
   <li>腾讯云公司对腾讯云提供的软件和服务之及时性、安全性、准确性不作担保，由于不可抗力因素、腾讯云公司无法控制的因素（包括黑客攻击、停断电等）等造成软件使用和服务中止或终止，而给您造成损失的，您同意放弃追究腾讯云公司责任的全部权利。   </li>
   <li>腾讯云公司特别提请您注意，腾讯云公司为了保障公司业务发展和调整的自主权，腾讯云公司拥有随时经或未经事先通知而修改服务内容、中止或终止部分或全部软件使用和服务的权利，修改会公布于腾讯云公司网站相关页面上，一经公布视为通知。 腾讯云公司行使修改或中止、终止部分或全部软件使用和服务的权利而造成损失的，腾讯云公司不需对您或任何第三方负责。</li>
</ol>

<p>有关腾讯云产品最终用户授权协议、商业授权与技术服务的详细内容，均由腾讯云公司独家提供。腾讯云公司拥有在不事先通知的情况下，修改授权协议和服务价目表的权利，修改后的协议或价目表对自改变之日起的新授权用户生效。</p>

<p>一旦您开始安装腾讯云产品，即被视为完全理解并接受本协议的各项条款，在享有上述条款授予的权利的同时，受到相关的约束和限制。协议许可范围以外的行为，将直接违反本授权协议并构成侵权，我们有权随时终止授权，责令停止损害，并保留追究相关责任的权力。</p>

<p>本许可协议条款的解释，效力及纠纷的解决，适用于中华人民共和国大陆法律。</p>

<p>若您和腾讯云之间发生任何纠纷或争议，首先应友好协商解决，协商不成的，您在此完全同意将纠纷或争议提交腾讯云所在地北京市海淀区人民法院管辖。腾讯云公司拥有对以上各项条款内容的解释权及修改权。</p>

<p>（正文完）</p>

<p align="right">腾讯云公司</p>

</div>',

	'php8_tips' => '您好，当前产品暂不支持 PHP 9 安装，请降级到至少 PHP 8.0 后再试！',
	'no_utf8_tips' => '您好，您使用的版本为 GBK / BIG-5 等本地化编码版本，此版本已经不作为主推版本，如果您计划建设新站点【强烈】建议您使用最新正式 UTF-8 版本安装。',
	'no_latest_tips' => '您好，您使用的版本较老，可能存在 Bug 以及安全隐患，如无特殊情况建议您改用最新正式 UTF-8 版本安装。',
	'unstable_tips' => '您好，您使用的版本为非正式版本，可能存在未知的 Bug 或缺陷，如果您计划正式建站或购买插件建议您使用最新正式 UTF-8 版本安装。',
	'next_tips' => '\r\n点击【确定】跳转到最新正式 UTF-8 版本下载页面，点击【取消】继续安装（不推荐）',

	'uc_installed' => '您已经安装过 UCenter，如果需要重新安装，请删除 data/install.lock 文件',
	'i_agree' => '我已仔细阅读，并同意上述条款中的所有内容',
	'supportted' => '支持',
	'unsupportted' => '不支持',
	'max_size' => '支持/最大尺寸',
	'project' => '项目',
	'ucenter_required' => 'Discuz! 所需配置',
	'ucenter_best' => 'Discuz! 最佳',
	'curr_server' => '当前服务器',
	'env_check' => '环境检查',
	'os' => '操作系统',
	'php' => 'PHP 版本',
	'attachmentupload' => '附件上传',
	'unlimit' => '不限制',
	'version' => '版本',
	'gdversion' => 'GD 库',
	'allow' => '允许 ',
	'unix' => '类Unix',
	'diskspace' => '磁盘空间',
	'opcache' => 'OPcache',
	'curl' => 'cURL 库',
	'priv_check' => '目录、文件权限检查',
	'func_depend' => '函数依赖性检查',
	'func_name' => '函数名称',
	'check_result' => '检查结果',
	'suggestion' => '建议',
	'advice_mysqli' => '请检查 mysqli 模块是否正确加载',
	'advice_fopen' => '该函数需要 php.ini 中 allow_url_fopen 选项开启。请联系服务商，确定开启了此项功能',
	'advice_xml' => '该函数需要 PHP 支持 XML。请联系服务商，确定开启了此项功能',
	'none' => '无',
	'undefine_func' => '不存在的函数',
	'mysqli_unsupport' => '请检查 mysqli 模块是否正确加载',

	'dbhost' => '数据库服务器地址',
	'dbuser' => '数据库用户名',
	'dbpw' => '数据库密码',
	'dbname' => '数据库名',
	'tablepre' => '数据表前缀',

	'ucfounderpw' => '创始人密码',
	'ucfounderpw2' => '重复创始人密码',

	'clear_dir' => '清空目录',
	'select_db' => '选择数据库',
	'create_table' => '建立数据表',
	'succeed' => '成功',
	'failed' => '失败',

	'init_table_data' => '正在初始化数据表中的数据',
	'install_data' => '正在安装数据',
	'install_test_data' => '正在安装附加数据',

	'method_undefined' => '未定义方法',
	'database_nonexistence' => '数据库操作对象不存在',
	'skip_current' => '跳过本步',
	'topic' => '专题',
	'install_finish' => '站点安装完成，感谢您的支持！',
	'install_finish_next' => '接下来您可以：',
	'finish_btn_admin' => '进入管理后台',
	'finish_btn_cloudaddon' => '安装插件模板',
	'finish_btn_direct' => '直接访问站点',

);

$msglang = array(
	'config_nonexistence' => '您的 config.inc.php 不存在, 无法继续安装, 请用 FTP 将该文件上传后再试。',
);

?>