<?php

/**
 *      [Discuz!] (C)2001-2099 Comsenz Inc.
 *      This is NOT a freeware, use is subject to license terms
 *
 *      $Id: lang_modaction.php 31651 2012-09-18 10:23:26Z zhangjie $
 */

if(!defined('IN_DISCUZ')) {
	exit('Access Denied');
}

$lang = array
(

	'EDT' => 'แก้ไข',

	'DEL' => 'ลบทิ้ง',
	'DLP' => 'ลบคำตอบ',
	'DCM' => 'ลบความเห็น',
	'PRN' => 'ลบโพสต์จำนวนมาก',
	'UDL' => 'ยกเลิกการลบ',

	'DIG' => 'เพิ่มกระทู้สำคัญ',
	'UDG' => 'เอาออกจากกระทู้สำคัญ',
	'EDI' => 'จำกัดเวลากระทู้สำคัญ',
	'UED' => 'ยกเลิกเวลากระทู้สำคัญ',

	'CLS' => 'ปิด',
	'OPN' => 'เปิด',
	'ECL' => 'จำกัดเวลาปิด',
	'UEC' => 'ยกเลิกการจำกัดเวลาปิด',
	'EOP' => 'จำกัดเวลาเปิด',
	'UEO' => 'ยกเลิกเวลาเปิด',

	'STK' => 'ปักหมุด',
	'UST' => 'ถอดหมุด',
	'EST' => 'จำกัดเวลาปักหมุด',
	'UES' => 'ยกเลิกเวลาปักหมุด',

	'SPL' => 'แยก',
	'MRG' => 'ผสาน',

	'HLT' => 'ไฮไลต์',
	'UHL' => 'ยกเลิกไฮไลต์',
	'EHL' => 'ตั้งเวลาไฮไลต์',
	'UEH' => 'ยกเลิกเวลาไฮไลต์',

	'BMP' => 'ส่งเสริม',
	'DWN' => 'กีดกั้น',

	'MOV' => 'ย้าย',
	'CPY' => 'คัดลอก',
	'TYP' => 'หมวด',

	'RFD' => 'คืนเงิน',

	'MOD' => 'สอบผ่าน',

	'ABL' => 'เพิ่มลงคอลเลกชัน',
	'RBL' => 'เอาออกคอลเลกชัน',

	'PTS' => 'ดันกระทู้',
	'RFS' => 'เลิกดันกระทู้',
	'RMR' => 'ยกเลิกรางวัล',
	'BNP' => 'แบนโพสต์',
	'UBN' => 'ปลดแบน',

	'REC' => 'แนะนำ',
	'URE' => 'เลิกแนะนำ',

	'WRN' => 'ตักเตือน',
	'UWN' => 'ยกเลิกคำเตือน',

	'SPA' => 'ประทับตรา',
	'SPD' => 'ลบตราประทับ',

	'SLA' => 'ติดไอคอน',
	'SLD' => 'ลบไอคอน',

	'REG' => 'แนะนำกลุ่ม',

	'PTA' => 'สร้างบทความ',

	'MAG' => 'พร็อพ',

	'REB' => 'ผลักดัน',

	'LIV' => 'LIVE',
	'LIC' => 'ปิดLIVE',

);

?>